-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th10 09, 2024 lúc 06:48 AM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `wiseowl`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `code_exercises`
--

CREATE TABLE `code_exercises` (
  `exercise_id` int(11) NOT NULL,
  `prompt` longtext NOT NULL,
  `language` enum('Cpp','Java','Pascal','Python') NOT NULL,
  `starter_code` text DEFAULT NULL,
  `time_limit` int(11) DEFAULT NULL,
  `test_cases` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`test_cases`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `email_verifications`
--

CREATE TABLE `email_verifications` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `user_id` int(11) NOT NULL,
  `expires_at` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `exercises`
--

CREATE TABLE `exercises` (
  `id` int(11) NOT NULL,
  `topic_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `type` enum('multiple_choice','code') NOT NULL,
  `level` enum('easy','medium','hard') NOT NULL DEFAULT 'easy',
  `is_key_exercise` tinyint(1) NOT NULL DEFAULT 0,
  `created_by` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_by` int(11) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `logs`
--

CREATE TABLE `logs` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `action` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `detail` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `logs`
--

INSERT INTO `logs` (`id`, `user_id`, `action`, `status`, `detail`, `created_at`) VALUES
(1, 1, 'Đăng nhập với tư cách quản trị viên', 0, '[2024:10:31 12:03:46]: Mật khẩu không chính xác.', '2024-10-31 05:03:46'),
(2, 1, 'Đăng nhập với tư cách quản trị viên', 0, '', '2024-10-31 05:06:27'),
(3, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:10:31 12:06:52]: Đăng nhập thành công.', '2024-10-31 05:06:52'),
(4, 2, 'Quản trị viên', 0, '[2024:10:31 12:15:45]: Mã xác thực hết hạn', '2024-10-31 05:15:45'),
(5, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:10:31 12:16:11]: Đăng nhập thành công.', '2024-10-31 05:16:11'),
(6, 2, 'Quản trị viên', 0, '[2024:10:31 12:16:12]: Mã xác thực hết hạn', '2024-10-31 05:16:12'),
(7, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:10:31 12:17:27]: Đăng nhập thành công.', '2024-10-31 05:17:27'),
(8, 2, 'Quản trị viên', 0, '[2024:10:31 12:17:28]: Mã xác thực hết hạn', '2024-10-31 05:17:28'),
(9, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:10:31 12:18:20]: Đăng nhập thành công.', '2024-10-31 05:18:20'),
(10, 2, 'Quản trị viên', 0, '[2024:10:31 12:18:21]: Mã xác thực hết hạn', '2024-10-31 05:18:21'),
(11, 1, 'Quản trị viên', 0, '', '2024-10-31 05:24:34'),
(12, 1, 'Quản trị viên', 0, '', '2024-10-31 05:25:23'),
(13, 1, 'Quản trị viên', 0, '', '2024-10-31 05:25:50'),
(14, 1, 'Quản trị viên', 0, '', '2024-10-31 05:27:36'),
(15, 1, 'Quản trị viên', 0, '', '2024-10-31 05:28:07'),
(16, 1, 'Quản trị viên', 0, '', '2024-10-31 05:29:37'),
(17, 1, 'Quản trị viên', 0, '', '2024-10-31 05:30:38'),
(18, 1, 'Quản trị viên', 0, '', '2024-10-31 05:31:06'),
(19, 1, 'Quản trị viên', 0, '', '2024-10-31 05:36:41'),
(20, 1, 'Quản trị viên', 0, '', '2024-10-31 05:36:52'),
(21, 1, 'Quản trị viên', 0, '', '2024-10-31 05:37:21'),
(22, 1, 'Quản trị viên', 0, '', '2024-10-31 05:40:56'),
(23, 1, 'Quản trị viên', 0, '', '2024-10-31 05:53:28'),
(24, 1, 'Quản trị viên', 0, '', '2024-10-31 07:42:29'),
(25, 1, 'Quản trị viên', 0, '', '2024-10-31 07:43:43'),
(26, 1, 'Quản trị viên', 0, '', '2024-10-31 07:44:04'),
(27, 1, 'Quản trị viên', 0, '', '2024-10-31 07:45:09'),
(28, 1, 'Quản trị viên', 0, '', '2024-10-31 07:45:37'),
(29, 1, 'Quản trị viên', 0, '', '2024-10-31 07:46:06'),
(30, 1, 'Quản trị viên', 0, '', '2024-10-31 07:46:45'),
(31, 1, 'Quản trị viên', 0, '', '2024-10-31 07:49:06'),
(32, 1, 'Quản trị viên', 0, '', '2024-10-31 07:49:58'),
(33, 1, 'Quản trị viên', 0, '', '2024-10-31 07:50:25'),
(34, 1, 'Quản trị viên', 0, '', '2024-10-31 07:51:19'),
(35, 1, 'Quản trị viên', 0, '', '2024-10-31 07:51:42'),
(36, 1, 'Quản trị viên', 0, '', '2024-10-31 07:51:55'),
(37, 1, 'Quản trị viên', 0, '', '2024-10-31 07:52:28'),
(38, 1, 'Quản trị viên', 0, '', '2024-10-31 07:52:46'),
(39, 1, 'Quản trị viên', 0, '', '2024-10-31 07:54:21'),
(40, 1, 'Quản trị viên', 0, '', '2024-10-31 07:54:51'),
(41, 1, 'Quản trị viên', 0, '', '2024-10-31 07:55:05'),
(42, 1, 'Quản trị viên', 0, '', '2024-10-31 08:07:12'),
(43, 1, 'Quản trị viên', 0, '', '2024-10-31 08:18:59'),
(44, 1, 'Quản trị viên', 0, '', '2024-10-31 08:31:57'),
(45, 2, 'Quản trị viên', 0, '[2024:11:01 20:21:58]: Mã xác thực hết hạn', '2024-11-01 13:21:58'),
(46, 2, 'Quản trị viên', 0, '[2024:11:02 10:39:06]: Mã xác thực hết hạn', '2024-11-02 03:39:06'),
(47, 1, 'Quản trị viên', 0, '', '2024-11-02 03:41:46'),
(48, 1, 'Quản trị viên', 0, '', '2024-11-02 03:42:04'),
(49, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:11:02 10:42:14]: Đăng nhập thành công.', '2024-11-02 03:42:14'),
(50, 1, 'Quản trị viên', 0, '', '2024-11-02 03:42:15'),
(51, 2, 'Quản trị viên', 0, '[2024:11:03 19:30:40]: Mã xác thực hết hạn', '2024-11-03 12:30:40'),
(52, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:11:03 19:31:09]: Đăng nhập thành công.', '2024-11-03 12:31:09'),
(53, 1, 'Quản trị viên', 0, '', '2024-11-03 12:31:10'),
(54, 1, 'Quản trị viên', 0, '', '2024-11-03 12:56:16'),
(55, 1, 'Quản trị viên', 0, '', '2024-11-03 12:56:24'),
(56, 1, 'Quản trị viên', 0, '', '2024-11-03 12:56:45'),
(57, 1, 'Quản trị viên', 0, '', '2024-11-03 13:04:45'),
(58, 1, 'Quản trị viên', 0, '', '2024-11-03 13:05:00'),
(59, 1, 'Quản trị viên', 0, '', '2024-11-03 13:05:42'),
(60, 1, 'Quản trị viên', 0, '', '2024-11-03 13:06:08'),
(61, 1, 'Quản trị viên', 0, '', '2024-11-03 13:08:06'),
(62, 1, 'Quản trị viên', 0, '', '2024-11-03 13:08:23'),
(63, 1, 'Quản trị viên', 0, '', '2024-11-03 13:08:31'),
(64, 1, 'Quản trị viên', 0, '', '2024-11-03 13:08:46'),
(65, 1, 'Quản trị viên', 0, '', '2024-11-03 13:09:31'),
(66, 1, 'Quản trị viên', 0, '', '2024-11-03 13:09:58'),
(67, 1, 'Quản trị viên', 0, '', '2024-11-03 13:10:05'),
(68, 1, 'Quản trị viên', 0, '', '2024-11-03 13:13:41'),
(69, 1, 'Quản trị viên', 0, '', '2024-11-03 13:13:52'),
(70, 1, 'Quản trị viên', 0, '', '2024-11-03 13:14:34'),
(71, 1, 'Quản trị viên', 0, '', '2024-11-03 13:15:52'),
(72, 1, 'Quản trị viên', 0, '', '2024-11-03 13:16:10'),
(73, 1, 'Quản trị viên', 0, '', '2024-11-03 13:16:43'),
(74, 1, 'Quản trị viên', 0, '', '2024-11-03 13:17:06'),
(75, 1, 'Quản trị viên', 0, '', '2024-11-03 13:17:25'),
(76, 1, 'Quản trị viên', 0, '', '2024-11-03 13:19:26'),
(77, 1, 'Quản trị viên', 0, '', '2024-11-03 13:19:36'),
(78, 1, 'Quản trị viên', 0, '', '2024-11-03 13:22:29'),
(79, 1, 'Quản trị viên', 0, '', '2024-11-03 13:22:37'),
(80, 1, 'Quản trị viên', 0, '', '2024-11-03 13:22:54'),
(81, 1, 'Quản trị viên', 0, '', '2024-11-03 13:26:02'),
(82, 1, 'Quản trị viên', 0, '', '2024-11-03 13:26:38'),
(83, 1, 'Quản trị viên', 0, '', '2024-11-03 13:28:27'),
(84, 1, 'Quản trị viên', 0, '', '2024-11-03 13:29:07'),
(85, 1, 'Quản trị viên', 0, '', '2024-11-03 13:29:29'),
(86, 1, 'Quản trị viên', 0, '', '2024-11-03 13:31:05'),
(87, 1, 'Quản trị viên', 0, '', '2024-11-03 13:31:44'),
(88, 1, 'Quản trị viên', 0, '', '2024-11-03 13:32:07'),
(89, 1, 'Quản trị viên', 0, '', '2024-11-03 13:32:14'),
(90, 1, 'Quản trị viên', 0, '', '2024-11-03 13:32:56'),
(91, 1, 'Quản trị viên', 0, '', '2024-11-03 13:33:00'),
(92, 1, 'Quản trị viên', 0, '', '2024-11-03 14:10:30'),
(93, 1, 'Quản trị viên', 0, '', '2024-11-03 14:10:34'),
(94, 1, 'Quản trị viên', 0, '', '2024-11-03 14:10:57'),
(95, 1, 'Quản trị viên', 0, '', '2024-11-03 14:11:30'),
(96, 1, 'Quản trị viên', 0, '', '2024-11-03 14:18:01'),
(97, 2, 'Quản trị viên', 0, '[2024:11:05 14:53:31]: Mã xác thực hết hạn', '2024-11-05 07:53:31'),
(98, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:11:05 14:53:52]: Đăng nhập thành công.', '2024-11-05 07:53:52'),
(99, 1, 'Quản trị viên', 0, '', '2024-11-05 07:53:53'),
(100, 1, 'Quản trị viên', 1, '[2024:11:05 15:00:22]: Lấy danh sách quyền hạn', '2024-11-05 08:00:22'),
(101, 1, 'Quản trị viên', 1, '[2024:11:05 15:06:32]: Lấy danh sách quyền hạn', '2024-11-05 08:06:32'),
(102, 1, 'Quản trị viên', 1, '[2024:11:06 10:51:52]: Lấy danh sách quyền hạn', '2024-11-06 03:51:52'),
(103, 1, 'Quản trị viên', 1, '[2024:11:06 10:51:58]: Lấy danh sách quyền hạn', '2024-11-06 03:51:58'),
(104, 1, 'Quản trị viên', 1, '[2024:11:06 11:34:10]: Thấy thông tin cá nhân', '2024-11-06 04:34:10'),
(105, 1, 'Quản trị viên', 1, '[2024:11:06 11:35:55]: Thấy thông tin cá nhân', '2024-11-06 04:35:55'),
(106, 1, 'Quản trị viên', 1, '[2024:11:06 11:37:03]: Thấy thông tin cá nhân', '2024-11-06 04:37:03'),
(107, 1, 'Quản trị viên', 1, '[2024:11:06 11:39:05]: Thấy thông tin cá nhân', '2024-11-06 04:39:05'),
(108, 1, 'Quản trị viên', 1, '[2024:11:06 11:39:24]: Thấy thông tin cá nhân', '2024-11-06 04:39:24'),
(109, 1, 'Quản trị viên', 1, '[2024:11:06 11:39:48]: Thấy thông tin cá nhân', '2024-11-06 04:39:48'),
(110, 1, 'Quản trị viên', 1, '[2024:11:06 11:40:09]: Thấy thông tin cá nhân', '2024-11-06 04:40:09'),
(111, 1, 'Quản trị viên', 1, '[2024:11:06 11:40:24]: Lấy danh sách quyền hạn', '2024-11-06 04:40:24'),
(112, 1, 'Quản trị viên', 1, '[2024:11:06 11:40:24]: Thấy thông tin cá nhân', '2024-11-06 04:40:24'),
(113, 1, 'Quản trị viên', 1, '[2024:11:06 11:40:31]: Lấy danh sách quyền hạn', '2024-11-06 04:40:31'),
(114, 1, 'Quản trị viên', 1, '[2024:11:06 11:40:31]: Thấy thông tin cá nhân', '2024-11-06 04:40:31'),
(115, 1, 'Quản trị viên', 1, '[2024:11:06 22:38:06]: Lấy danh sách quyền hạn', '2024-11-06 15:38:06'),
(116, 1, 'Quản trị viên', 1, '[2024:11:06 22:38:06]: Thấy thông tin cá nhân', '2024-11-06 15:38:06'),
(117, 1, 'Quản trị viên', 1, '[2024:11:06 22:39:07]: Lấy danh sách quyền hạn', '2024-11-06 15:39:07'),
(118, 1, 'Quản trị viên', 1, '[2024:11:06 22:39:07]: Thấy thông tin cá nhân', '2024-11-06 15:39:07'),
(119, 1, 'Quản trị viên', 1, '[2024:11:06 22:41:00]: Lấy danh sách quyền hạn', '2024-11-06 15:41:00'),
(120, 1, 'Quản trị viên', 1, '[2024:11:06 22:41:00]: Thấy thông tin cá nhân', '2024-11-06 15:41:00'),
(121, 1, 'Quản trị viên', 1, '[2024:11:06 22:42:47]: Lấy danh sách quyền hạn', '2024-11-06 15:42:47'),
(122, 1, 'Quản trị viên', 1, '[2024:11:06 22:42:47]: Thấy thông tin cá nhân', '2024-11-06 15:42:47'),
(123, 1, 'Quản trị viên', 1, '[2024:11:06 22:43:48]: Lấy danh sách quyền hạn', '2024-11-06 15:43:48'),
(124, 1, 'Quản trị viên', 1, '[2024:11:06 22:43:48]: Thấy thông tin cá nhân', '2024-11-06 15:43:48'),
(125, 1, 'Quản trị viên', 1, '[2024:11:06 22:45:29]: Lấy danh sách quyền hạn', '2024-11-06 15:45:29'),
(126, 1, 'Quản trị viên', 1, '[2024:11:06 22:45:29]: Thấy thông tin cá nhân', '2024-11-06 15:45:29'),
(127, 1, 'Quản trị viên', 1, '[2024:11:06 22:49:24]: Lấy danh sách quyền hạn', '2024-11-06 15:49:24'),
(128, 1, 'Quản trị viên', 1, '[2024:11:06 22:49:24]: Thấy thông tin cá nhân', '2024-11-06 15:49:24'),
(129, 1, 'Quản trị viên', 1, '[2024:11:06 22:55:55]: Lấy danh sách quyền hạn', '2024-11-06 15:55:55'),
(130, 1, 'Quản trị viên', 1, '[2024:11:06 22:55:55]: Thấy thông tin cá nhân', '2024-11-06 15:55:55'),
(131, 1, 'Quản trị viên', 1, '[2024:11:06 22:56:32]: Thấy thông tin cá nhân', '2024-11-06 15:56:32'),
(132, 1, 'Quản trị viên', 1, '[2024:11:06 22:56:32]: Lấy danh sách quyền hạn', '2024-11-06 15:56:32'),
(133, 1, 'Quản trị viên', 1, '[2024:11:06 22:56:49]: Lấy danh sách quyền hạn', '2024-11-06 15:56:49'),
(134, 1, 'Quản trị viên', 1, '[2024:11:06 22:56:49]: Thấy thông tin cá nhân', '2024-11-06 15:56:49'),
(135, 1, 'Quản trị viên', 1, '[2024:11:06 22:57:35]: Lấy danh sách quyền hạn', '2024-11-06 15:57:35'),
(136, 1, 'Quản trị viên', 1, '[2024:11:06 22:57:35]: Thấy thông tin cá nhân', '2024-11-06 15:57:35'),
(137, 1, 'Quản trị viên', 1, '[2024:11:06 22:58:06]: Lấy danh sách quyền hạn', '2024-11-06 15:58:06'),
(138, 1, 'Quản trị viên', 1, '[2024:11:06 22:58:06]: Thấy thông tin cá nhân', '2024-11-06 15:58:06'),
(139, 1, 'Quản trị viên', 1, '[2024:11:06 23:06:53]: Lấy danh sách quyền hạn', '2024-11-06 16:06:53'),
(140, 1, 'Quản trị viên', 1, '[2024:11:06 23:06:53]: Thấy thông tin cá nhân', '2024-11-06 16:06:53'),
(141, 1, 'Quản trị viên', 1, '[2024:11:06 23:07:14]: Lấy danh sách quyền hạn', '2024-11-06 16:07:14'),
(142, 1, 'Quản trị viên', 1, '[2024:11:06 23:07:14]: Thấy thông tin cá nhân', '2024-11-06 16:07:14'),
(143, 1, 'Quản trị viên', 1, '[2024:11:06 23:11:45]: Lấy danh sách quyền hạn', '2024-11-06 16:11:45'),
(144, 1, 'Quản trị viên', 1, '[2024:11:06 23:11:45]: Thấy thông tin cá nhân', '2024-11-06 16:11:45'),
(145, 1, 'Quản trị viên', 1, '[2024:11:06 23:12:33]: Lấy danh sách quyền hạn', '2024-11-06 16:12:33'),
(146, 1, 'Quản trị viên', 1, '[2024:11:06 23:12:33]: Thấy thông tin cá nhân', '2024-11-06 16:12:33'),
(147, 1, 'Quản trị viên', 1, '[2024:11:06 23:12:59]: Lấy danh sách quyền hạn', '2024-11-06 16:12:59'),
(148, 1, 'Quản trị viên', 1, '[2024:11:06 23:12:59]: Thấy thông tin cá nhân', '2024-11-06 16:12:59'),
(149, 1, 'Quản trị viên', 1, '[2024:11:06 23:13:33]: Lấy danh sách quyền hạn', '2024-11-06 16:13:33'),
(150, 1, 'Quản trị viên', 1, '[2024:11:06 23:13:33]: Thấy thông tin cá nhân', '2024-11-06 16:13:33'),
(151, 1, 'Quản trị viên', 1, '[2024:11:06 23:13:43]: Lấy danh sách quyền hạn', '2024-11-06 16:13:42'),
(152, 1, 'Quản trị viên', 1, '[2024:11:06 23:13:43]: Thấy thông tin cá nhân', '2024-11-06 16:13:42'),
(153, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:20]: Lấy danh sách quyền hạn', '2024-11-06 16:36:20'),
(154, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:20]: Thấy thông tin cá nhân', '2024-11-06 16:36:20'),
(155, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:33]: Lấy danh sách quyền hạn', '2024-11-06 16:36:33'),
(156, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:33]: Thấy thông tin cá nhân', '2024-11-06 16:36:33'),
(157, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:46]: Lấy danh sách quyền hạn', '2024-11-06 16:36:46'),
(158, 1, 'Quản trị viên', 1, '[2024:11:06 23:36:46]: Thấy thông tin cá nhân', '2024-11-06 16:36:46'),
(159, 1, 'Quản trị viên', 1, '[2024:11:07 08:50:10]: Lấy danh sách quyền hạn', '2024-11-07 01:50:10'),
(160, 1, 'Quản trị viên', 1, '[2024:11:07 08:50:10]: Thấy thông tin cá nhân', '2024-11-07 01:50:10'),
(161, 1, 'Quản trị viên', 1, '[2024:11:07 08:53:45]: Lấy danh sách quyền hạn', '2024-11-07 01:53:45'),
(162, 1, 'Quản trị viên', 1, '[2024:11:07 08:53:45]: Thấy thông tin cá nhân', '2024-11-07 01:53:45'),
(163, 1, 'Quản trị viên', 1, '[2024:11:07 08:54:55]: Lấy danh sách quyền hạn', '2024-11-07 01:54:55'),
(164, 1, 'Quản trị viên', 1, '[2024:11:07 08:54:55]: Thấy thông tin cá nhân', '2024-11-07 01:54:55'),
(165, 1, 'Quản trị viên', 1, '[2024:11:07 08:57:59]: Lấy danh sách quyền hạn', '2024-11-07 01:57:59'),
(166, 1, 'Quản trị viên', 1, '[2024:11:07 08:57:59]: Thấy thông tin cá nhân', '2024-11-07 01:57:59'),
(167, 1, 'Quản trị viên', 1, '[2024:11:07 08:58:10]: Lấy danh sách quyền hạn', '2024-11-07 01:58:10'),
(168, 1, 'Quản trị viên', 1, '[2024:11:07 08:58:10]: Thấy thông tin cá nhân', '2024-11-07 01:58:10'),
(169, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:05]: Lấy danh sách quyền hạn', '2024-11-07 01:59:05'),
(170, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:05]: Thấy thông tin cá nhân', '2024-11-07 01:59:05'),
(171, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:15]: Lấy danh sách quyền hạn', '2024-11-07 01:59:15'),
(172, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:15]: Thấy thông tin cá nhân', '2024-11-07 01:59:15'),
(173, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:29]: Lấy danh sách quyền hạn', '2024-11-07 01:59:29'),
(174, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:29]: Thấy thông tin cá nhân', '2024-11-07 01:59:29'),
(175, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:38]: Lấy danh sách quyền hạn', '2024-11-07 01:59:38'),
(176, 1, 'Quản trị viên', 1, '[2024:11:07 08:59:38]: Thấy thông tin cá nhân', '2024-11-07 01:59:38'),
(177, 1, 'Quản trị viên', 1, '[2024:11:07 09:00:52]: Lấy danh sách quyền hạn', '2024-11-07 02:00:52'),
(178, 1, 'Quản trị viên', 1, '[2024:11:07 09:00:52]: Thấy thông tin cá nhân', '2024-11-07 02:00:52'),
(179, 1, 'Quản trị viên', 1, '[2024:11:07 09:04:13]: Lấy danh sách quyền hạn', '2024-11-07 02:04:13'),
(180, 1, 'Quản trị viên', 1, '[2024:11:07 09:04:13]: Thấy thông tin cá nhân', '2024-11-07 02:04:13'),
(181, 1, 'Quản trị viên', 1, '[2024:11:07 09:08:10]: Lấy danh sách quyền hạn', '2024-11-07 02:08:10'),
(182, 1, 'Quản trị viên', 1, '[2024:11:07 09:08:10]: Thấy thông tin cá nhân', '2024-11-07 02:08:10'),
(183, 1, 'Quản trị viên', 1, '[2024:11:07 09:12:28]: Lấy danh sách quyền hạn', '2024-11-07 02:12:28'),
(184, 1, 'Quản trị viên', 1, '[2024:11:07 09:12:28]: Thấy thông tin cá nhân', '2024-11-07 02:12:28'),
(185, 1, 'Quản trị viên', 1, '[2024:11:07 09:13:05]: Lấy danh sách quyền hạn', '2024-11-07 02:13:05'),
(186, 1, 'Quản trị viên', 1, '[2024:11:07 09:13:05]: Thấy thông tin cá nhân', '2024-11-07 02:13:05'),
(187, 1, 'Quản trị viên', 1, '[2024:11:07 09:13:52]: Lấy danh sách quyền hạn', '2024-11-07 02:13:52'),
(188, 1, 'Quản trị viên', 1, '[2024:11:07 09:13:52]: Thấy thông tin cá nhân', '2024-11-07 02:13:52'),
(189, 1, 'Quản trị viên', 1, '[2024:11:07 09:16:52]: Lấy danh sách quyền hạn', '2024-11-07 02:16:52'),
(190, 1, 'Quản trị viên', 1, '[2024:11:07 09:16:52]: Thấy thông tin cá nhân', '2024-11-07 02:16:52'),
(191, 1, 'Quản trị viên', 1, '[2024:11:07 09:17:21]: Lấy danh sách quyền hạn', '2024-11-07 02:17:21'),
(192, 1, 'Quản trị viên', 1, '[2024:11:07 09:17:21]: Thấy thông tin cá nhân', '2024-11-07 02:17:21'),
(193, 1, 'Quản trị viên', 1, '[2024:11:07 09:18:17]: Lấy danh sách quyền hạn', '2024-11-07 02:18:17'),
(194, 1, 'Quản trị viên', 1, '[2024:11:07 09:18:17]: Thấy thông tin cá nhân', '2024-11-07 02:18:17'),
(195, 1, 'Quản trị viên', 1, '[2024:11:07 09:19:12]: Lấy danh sách quyền hạn', '2024-11-07 02:19:12'),
(196, 1, 'Quản trị viên', 1, '[2024:11:07 09:19:12]: Thấy thông tin cá nhân', '2024-11-07 02:19:12'),
(197, 1, 'Quản trị viên', 1, '[2024:11:07 09:22:24]: Lấy danh sách quyền hạn', '2024-11-07 02:22:24'),
(198, 1, 'Quản trị viên', 1, '[2024:11:07 09:22:24]: Thấy thông tin cá nhân', '2024-11-07 02:22:24'),
(199, 1, 'Quản trị viên', 1, '[2024:11:07 09:22:40]: Lấy danh sách quyền hạn', '2024-11-07 02:22:40'),
(200, 1, 'Quản trị viên', 1, '[2024:11:07 09:22:40]: Thấy thông tin cá nhân', '2024-11-07 02:22:40'),
(201, 1, 'Quản trị viên', 1, '[2024:11:07 09:26:44]: Lấy danh sách quyền hạn', '2024-11-07 02:26:44'),
(202, 1, 'Quản trị viên', 1, '[2024:11:07 09:26:44]: Thấy thông tin cá nhân', '2024-11-07 02:26:44'),
(203, 1, 'Quản trị viên', 1, '[2024:11:07 09:26:57]: Lấy danh sách quyền hạn', '2024-11-07 02:26:57'),
(204, 1, 'Quản trị viên', 1, '[2024:11:07 09:26:57]: Thấy thông tin cá nhân', '2024-11-07 02:26:57'),
(205, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:06]: Lấy danh sách quyền hạn', '2024-11-07 02:27:06'),
(206, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:06]: Thấy thông tin cá nhân', '2024-11-07 02:27:06'),
(207, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:29]: Lấy danh sách quyền hạn', '2024-11-07 02:27:29'),
(208, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:29]: Thấy thông tin cá nhân', '2024-11-07 02:27:29'),
(209, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:42]: Lấy danh sách quyền hạn', '2024-11-07 02:27:42'),
(210, 1, 'Quản trị viên', 1, '[2024:11:07 09:27:42]: Thấy thông tin cá nhân', '2024-11-07 02:27:42'),
(211, 1, 'Quản trị viên', 1, '[2024:11:07 09:31:31]: Lấy danh sách quyền hạn', '2024-11-07 02:31:31'),
(212, 1, 'Quản trị viên', 1, '[2024:11:07 09:31:31]: Thấy thông tin cá nhân', '2024-11-07 02:31:31'),
(213, 1, 'Quản trị viên', 1, '[2024:11:07 09:31:54]: Lấy danh sách quyền hạn', '2024-11-07 02:31:54'),
(214, 1, 'Quản trị viên', 1, '[2024:11:07 09:31:54]: Thấy thông tin cá nhân', '2024-11-07 02:31:54'),
(215, 1, 'Quản trị viên', 1, '[2024:11:07 09:32:05]: Lấy danh sách quyền hạn', '2024-11-07 02:32:05'),
(216, 1, 'Quản trị viên', 1, '[2024:11:07 09:32:05]: Thấy thông tin cá nhân', '2024-11-07 02:32:05'),
(217, 1, 'Quản trị viên', 1, '[2024:11:07 09:34:16]: Lấy danh sách quyền hạn', '2024-11-07 02:34:16'),
(218, 1, 'Quản trị viên', 1, '[2024:11:07 09:34:16]: Thấy thông tin cá nhân', '2024-11-07 02:34:16'),
(219, 1, 'Quản trị viên', 1, '[2024:11:07 09:34:24]: Lấy danh sách quyền hạn', '2024-11-07 02:34:24'),
(220, 1, 'Quản trị viên', 1, '[2024:11:07 09:34:24]: Thấy thông tin cá nhân', '2024-11-07 02:34:24'),
(221, 1, 'Quản trị viên', 1, '[2024:11:07 09:36:26]: Lấy danh sách quyền hạn', '2024-11-07 02:36:26'),
(222, 1, 'Quản trị viên', 1, '[2024:11:07 09:36:26]: Thấy thông tin cá nhân', '2024-11-07 02:36:26'),
(223, 1, 'Quản trị viên', 1, '[2024:11:07 09:36:39]: Lấy danh sách quyền hạn', '2024-11-07 02:36:39'),
(224, 1, 'Quản trị viên', 1, '[2024:11:07 09:36:39]: Thấy thông tin cá nhân', '2024-11-07 02:36:39'),
(225, 1, 'Quản trị viên', 1, '[2024:11:07 09:38:36]: Lấy danh sách quyền hạn', '2024-11-07 02:38:36'),
(226, 1, 'Quản trị viên', 1, '[2024:11:07 09:38:36]: Thấy thông tin cá nhân', '2024-11-07 02:38:36'),
(227, 1, 'Quản trị viên', 1, '[2024:11:07 09:39:01]: Lấy danh sách quyền hạn', '2024-11-07 02:39:01'),
(228, 1, 'Quản trị viên', 1, '[2024:11:07 09:39:01]: Thấy thông tin cá nhân', '2024-11-07 02:39:01'),
(229, 1, 'Quản trị viên', 1, '[2024:11:07 09:48:09]: Lấy danh sách quyền hạn', '2024-11-07 02:48:09'),
(230, 1, 'Quản trị viên', 1, '[2024:11:07 09:48:09]: Thấy thông tin cá nhân', '2024-11-07 02:48:09'),
(231, 1, 'Quản trị viên', 1, '[2024:11:07 10:00:01]: Lấy danh sách quyền hạn', '2024-11-07 03:00:01'),
(232, 1, 'Quản trị viên', 1, '[2024:11:07 10:00:01]: Thấy thông tin cá nhân', '2024-11-07 03:00:01'),
(233, 1, 'Quản trị viên', 1, '[2024:11:07 12:15:24]: Lấy danh sách quyền hạn', '2024-11-07 05:15:24'),
(234, 1, 'Quản trị viên', 1, '[2024:11:07 12:15:24]: Thấy thông tin cá nhân', '2024-11-07 05:15:24'),
(235, 1, 'Quản trị viên', 1, '[2024:11:07 12:22:06]: Lấy danh sách quyền hạn', '2024-11-07 05:22:06'),
(236, 1, 'Quản trị viên', 1, '[2024:11:07 12:22:06]: Thấy thông tin cá nhân', '2024-11-07 05:22:06'),
(237, 1, 'Quản trị viên', 1, '[2024:11:07 12:25:22]: Lấy danh sách quyền hạn', '2024-11-07 05:25:22'),
(238, 1, 'Quản trị viên', 1, '[2024:11:07 12:25:22]: Thấy thông tin cá nhân', '2024-11-07 05:25:22'),
(239, 1, 'Quản trị viên', 1, '[2024:11:07 12:43:19]: Lấy danh sách quyền hạn', '2024-11-07 05:43:19'),
(240, 1, 'Quản trị viên', 1, '[2024:11:07 12:43:19]: Thấy thông tin cá nhân', '2024-11-07 05:43:19'),
(241, 1, 'Quản trị viên', 1, '[2024:11:07 12:43:44]: Lấy danh sách quyền hạn', '2024-11-07 05:43:44'),
(242, 1, 'Quản trị viên', 1, '[2024:11:07 12:43:44]: Thấy thông tin cá nhân', '2024-11-07 05:43:44'),
(243, 1, 'Quản trị viên', 1, '[2024:11:07 12:54:22]: Lấy danh sách quyền hạn', '2024-11-07 05:54:22'),
(244, 1, 'Quản trị viên', 1, '[2024:11:07 12:54:22]: Thấy thông tin cá nhân', '2024-11-07 05:54:22'),
(245, 1, 'Quản trị viên', 1, '[2024:11:07 13:08:34]: Lấy danh sách quyền hạn', '2024-11-07 06:08:34'),
(246, 1, 'Quản trị viên', 1, '[2024:11:07 13:08:34]: Thấy thông tin cá nhân', '2024-11-07 06:08:34'),
(247, 1, 'Quản trị viên', 1, '[2024:11:07 13:14:45]: Lấy danh sách quyền hạn', '2024-11-07 06:14:45'),
(248, 1, 'Quản trị viên', 1, '[2024:11:07 13:14:45]: Thấy thông tin cá nhân', '2024-11-07 06:14:45'),
(249, 1, 'Quản trị viên', 1, '[2024:11:07 13:15:34]: Lấy danh sách quyền hạn', '2024-11-07 06:15:34'),
(250, 1, 'Quản trị viên', 1, '[2024:11:07 13:15:34]: Thấy thông tin cá nhân', '2024-11-07 06:15:34'),
(251, 1, 'Quản trị viên', 1, '[2024:11:07 13:17:14]: Lấy danh sách quyền hạn', '2024-11-07 06:17:14'),
(252, 1, 'Quản trị viên', 1, '[2024:11:07 13:17:14]: Thấy thông tin cá nhân', '2024-11-07 06:17:14'),
(253, 1, 'Quản trị viên', 1, '[2024:11:07 13:17:35]: Lấy danh sách quyền hạn', '2024-11-07 06:17:35'),
(254, 1, 'Quản trị viên', 1, '[2024:11:07 13:17:35]: Thấy thông tin cá nhân', '2024-11-07 06:17:35'),
(255, 1, 'Quản trị viên', 1, '[2024:11:07 13:19:12]: Lấy danh sách quyền hạn', '2024-11-07 06:19:12'),
(256, 1, 'Quản trị viên', 1, '[2024:11:07 13:19:12]: Thấy thông tin cá nhân', '2024-11-07 06:19:12'),
(257, 1, 'Quản trị viên', 1, '[2024:11:07 13:20:08]: Lấy danh sách quyền hạn', '2024-11-07 06:20:08'),
(258, 1, 'Quản trị viên', 1, '[2024:11:07 13:20:08]: Thấy thông tin cá nhân', '2024-11-07 06:20:08'),
(259, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:02]: Lấy danh sách quyền hạn', '2024-11-07 06:28:02'),
(260, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:02]: Thấy thông tin cá nhân', '2024-11-07 06:28:02'),
(261, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:15]: Lấy danh sách quyền hạn', '2024-11-07 06:28:15'),
(262, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:15]: Thấy thông tin cá nhân', '2024-11-07 06:28:15'),
(263, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:54]: Lấy danh sách quyền hạn', '2024-11-07 06:28:54'),
(264, 1, 'Quản trị viên', 1, '[2024:11:07 13:28:54]: Thấy thông tin cá nhân', '2024-11-07 06:28:54'),
(265, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:06]: Lấy danh sách quyền hạn', '2024-11-07 06:29:06'),
(266, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:06]: Thấy thông tin cá nhân', '2024-11-07 06:29:06'),
(267, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:21]: Lấy danh sách quyền hạn', '2024-11-07 06:29:21'),
(268, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:21]: Thấy thông tin cá nhân', '2024-11-07 06:29:21'),
(269, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:59]: Lấy danh sách quyền hạn', '2024-11-07 06:29:59'),
(270, 1, 'Quản trị viên', 1, '[2024:11:07 13:29:59]: Thấy thông tin cá nhân', '2024-11-07 06:29:59'),
(271, 1, 'Quản trị viên', 1, '[2024:11:07 13:30:41]: Lấy danh sách quyền hạn', '2024-11-07 06:30:41'),
(272, 1, 'Quản trị viên', 1, '[2024:11:07 13:30:41]: Thấy thông tin cá nhân', '2024-11-07 06:30:41'),
(273, 1, 'Quản trị viên', 1, '[2024:11:07 13:32:17]: Lấy danh sách quyền hạn', '2024-11-07 06:32:17'),
(274, 1, 'Quản trị viên', 1, '[2024:11:07 13:32:17]: Thấy thông tin cá nhân', '2024-11-07 06:32:17'),
(275, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:00]: Lấy danh sách quyền hạn', '2024-11-07 06:33:00'),
(276, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:00]: Thấy thông tin cá nhân', '2024-11-07 06:33:00'),
(277, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:38]: Lấy danh sách quyền hạn', '2024-11-07 06:33:38'),
(278, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:38]: Thấy thông tin cá nhân', '2024-11-07 06:33:38'),
(279, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:58]: Lấy danh sách quyền hạn', '2024-11-07 06:33:58'),
(280, 1, 'Quản trị viên', 1, '[2024:11:07 13:33:58]: Thấy thông tin cá nhân', '2024-11-07 06:33:58'),
(281, 1, 'Quản trị viên', 1, '[2024:11:07 13:34:09]: Lấy danh sách quyền hạn', '2024-11-07 06:34:09'),
(282, 1, 'Quản trị viên', 1, '[2024:11:07 13:34:09]: Thấy thông tin cá nhân', '2024-11-07 06:34:09'),
(283, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:00]: Lấy danh sách quyền hạn', '2024-11-07 06:35:00'),
(284, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:00]: Thấy thông tin cá nhân', '2024-11-07 06:35:00'),
(285, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:26]: Lấy danh sách quyền hạn', '2024-11-07 06:35:26'),
(286, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:26]: Thấy thông tin cá nhân', '2024-11-07 06:35:26'),
(287, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:43]: Lấy danh sách quyền hạn', '2024-11-07 06:35:43'),
(288, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:43]: Thấy thông tin cá nhân', '2024-11-07 06:35:43'),
(289, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:51]: Lấy danh sách quyền hạn', '2024-11-07 06:35:51'),
(290, 1, 'Quản trị viên', 1, '[2024:11:07 13:35:51]: Thấy thông tin cá nhân', '2024-11-07 06:35:51'),
(291, 1, 'Quản trị viên', 1, '[2024:11:07 13:38:06]: Lấy danh sách quyền hạn', '2024-11-07 06:38:06'),
(292, 1, 'Quản trị viên', 1, '[2024:11:07 13:38:06]: Thấy thông tin cá nhân', '2024-11-07 06:38:06'),
(293, 1, 'Quản trị viên', 1, '[2024:11:07 13:38:50]: Lấy danh sách quyền hạn', '2024-11-07 06:38:50'),
(294, 1, 'Quản trị viên', 1, '[2024:11:07 13:38:50]: Thấy thông tin cá nhân', '2024-11-07 06:38:50'),
(295, 1, 'Quản trị viên', 1, '[2024:11:07 13:39:25]: Lấy danh sách quyền hạn', '2024-11-07 06:39:25'),
(296, 1, 'Quản trị viên', 1, '[2024:11:07 13:39:25]: Thấy thông tin cá nhân', '2024-11-07 06:39:25'),
(297, 1, 'Quản trị viên', 1, '[2024:11:07 13:41:12]: Lấy danh sách quyền hạn', '2024-11-07 06:41:12'),
(298, 1, 'Quản trị viên', 1, '[2024:11:07 13:41:12]: Thấy thông tin cá nhân', '2024-11-07 06:41:12'),
(299, 1, 'Quản trị viên', 1, '[2024:11:07 13:41:37]: Lấy danh sách quyền hạn', '2024-11-07 06:41:37'),
(300, 1, 'Quản trị viên', 1, '[2024:11:07 13:41:37]: Thấy thông tin cá nhân', '2024-11-07 06:41:37'),
(301, 1, 'Quản trị viên', 1, '[2024:11:07 13:42:24]: Lấy danh sách quyền hạn', '2024-11-07 06:42:24'),
(302, 1, 'Quản trị viên', 1, '[2024:11:07 13:42:24]: Thấy thông tin cá nhân', '2024-11-07 06:42:24'),
(303, 1, 'Quản trị viên', 1, '[2024:11:07 13:42:59]: Lấy danh sách quyền hạn', '2024-11-07 06:42:59'),
(304, 1, 'Quản trị viên', 1, '[2024:11:07 13:42:59]: Thấy thông tin cá nhân', '2024-11-07 06:42:59'),
(305, 1, 'Quản trị viên', 1, '[2024:11:07 13:43:27]: Lấy danh sách quyền hạn', '2024-11-07 06:43:27'),
(306, 1, 'Quản trị viên', 1, '[2024:11:07 13:43:27]: Thấy thông tin cá nhân', '2024-11-07 06:43:27'),
(307, 1, 'Quản trị viên', 1, '[2024:11:07 13:44:16]: Lấy danh sách quyền hạn', '2024-11-07 06:44:16'),
(308, 1, 'Quản trị viên', 1, '[2024:11:07 13:44:16]: Thấy thông tin cá nhân', '2024-11-07 06:44:16'),
(309, 1, 'Quản trị viên', 1, '[2024:11:07 13:44:54]: Lấy danh sách quyền hạn', '2024-11-07 06:44:54'),
(310, 1, 'Quản trị viên', 1, '[2024:11:07 13:44:54]: Thấy thông tin cá nhân', '2024-11-07 06:44:54'),
(311, 1, 'Quản trị viên', 1, '[2024:11:07 13:45:26]: Lấy danh sách quyền hạn', '2024-11-07 06:45:26'),
(312, 1, 'Quản trị viên', 1, '[2024:11:07 13:45:26]: Thấy thông tin cá nhân', '2024-11-07 06:45:26'),
(313, 1, 'Quản trị viên', 1, '[2024:11:07 13:47:42]: Lấy danh sách quyền hạn', '2024-11-07 06:47:42'),
(314, 1, 'Quản trị viên', 1, '[2024:11:07 13:47:42]: Thấy thông tin cá nhân', '2024-11-07 06:47:42'),
(315, 1, 'Quản trị viên', 1, '[2024:11:07 13:47:55]: Lấy danh sách quyền hạn', '2024-11-07 06:47:55'),
(316, 1, 'Quản trị viên', 1, '[2024:11:07 13:47:55]: Thấy thông tin cá nhân', '2024-11-07 06:47:55'),
(317, 1, 'Quản trị viên', 1, '[2024:11:07 13:48:41]: Lấy danh sách quyền hạn', '2024-11-07 06:48:41'),
(318, 1, 'Quản trị viên', 1, '[2024:11:07 13:48:41]: Thấy thông tin cá nhân', '2024-11-07 06:48:41'),
(319, 1, 'Quản trị viên', 1, '[2024:11:07 13:48:58]: Lấy danh sách quyền hạn', '2024-11-07 06:48:58'),
(320, 1, 'Quản trị viên', 1, '[2024:11:07 13:48:58]: Thấy thông tin cá nhân', '2024-11-07 06:48:58'),
(321, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:21]: Lấy danh sách quyền hạn', '2024-11-07 06:49:21'),
(322, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:21]: Thấy thông tin cá nhân', '2024-11-07 06:49:21'),
(323, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:35]: Lấy danh sách quyền hạn', '2024-11-07 06:49:35'),
(324, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:35]: Thấy thông tin cá nhân', '2024-11-07 06:49:35'),
(325, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:41]: Thấy thông tin cá nhân', '2024-11-07 06:49:41'),
(326, 1, 'Quản trị viên', 1, '[2024:11:07 13:49:41]: Lấy danh sách quyền hạn', '2024-11-07 06:49:41'),
(327, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:08]: Lấy danh sách quyền hạn', '2024-11-07 06:51:08'),
(328, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:08]: Thấy thông tin cá nhân', '2024-11-07 06:51:08'),
(329, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:23]: Lấy danh sách quyền hạn', '2024-11-07 06:51:23'),
(330, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:23]: Thấy thông tin cá nhân', '2024-11-07 06:51:23'),
(331, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:30]: Lấy danh sách quyền hạn', '2024-11-07 06:51:30'),
(332, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:30]: Thấy thông tin cá nhân', '2024-11-07 06:51:30'),
(333, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:35]: Lấy danh sách quyền hạn', '2024-11-07 06:51:35'),
(334, 1, 'Quản trị viên', 1, '[2024:11:07 13:51:35]: Thấy thông tin cá nhân', '2024-11-07 06:51:35'),
(335, 1, 'Quản trị viên', 1, '[2024:11:07 13:52:11]: Lấy danh sách quyền hạn', '2024-11-07 06:52:11'),
(336, 1, 'Quản trị viên', 1, '[2024:11:07 13:52:11]: Thấy thông tin cá nhân', '2024-11-07 06:52:11'),
(337, 1, 'Quản trị viên', 1, '[2024:11:07 13:52:35]: Lấy danh sách quyền hạn', '2024-11-07 06:52:35'),
(338, 1, 'Quản trị viên', 1, '[2024:11:07 13:52:35]: Thấy thông tin cá nhân', '2024-11-07 06:52:35'),
(339, 1, 'Quản trị viên', 1, '[2024:11:07 13:54:13]: Lấy danh sách quyền hạn', '2024-11-07 06:54:13'),
(340, 1, 'Quản trị viên', 1, '[2024:11:07 13:54:13]: Thấy thông tin cá nhân', '2024-11-07 06:54:13'),
(341, 1, 'Quản trị viên', 1, '[2024:11:07 13:56:00]: Lấy danh sách quyền hạn', '2024-11-07 06:56:00'),
(342, 1, 'Quản trị viên', 1, '[2024:11:07 13:56:00]: Thấy thông tin cá nhân', '2024-11-07 06:56:00'),
(343, 1, 'Quản trị viên', 1, '[2024:11:07 13:57:24]: Lấy danh sách quyền hạn', '2024-11-07 06:57:24'),
(344, 1, 'Quản trị viên', 1, '[2024:11:07 13:57:24]: Thấy thông tin cá nhân', '2024-11-07 06:57:24'),
(345, 1, 'Quản trị viên', 1, '[2024:11:07 13:57:30]: Lấy danh sách quyền hạn', '2024-11-07 06:57:30'),
(346, 1, 'Quản trị viên', 1, '[2024:11:07 13:57:30]: Thấy thông tin cá nhân', '2024-11-07 06:57:30'),
(347, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:06]: Lấy danh sách quyền hạn', '2024-11-07 06:59:06'),
(348, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:06]: Thấy thông tin cá nhân', '2024-11-07 06:59:06'),
(349, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:37]: Lấy danh sách quyền hạn', '2024-11-07 06:59:37'),
(350, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:37]: Thấy thông tin cá nhân', '2024-11-07 06:59:37'),
(351, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:56]: Lấy danh sách quyền hạn', '2024-11-07 06:59:56'),
(352, 1, 'Quản trị viên', 1, '[2024:11:07 13:59:56]: Thấy thông tin cá nhân', '2024-11-07 06:59:56'),
(353, 1, 'Quản trị viên', 1, '[2024:11:07 14:02:05]: Lấy danh sách quyền hạn', '2024-11-07 07:02:05'),
(354, 1, 'Quản trị viên', 1, '[2024:11:07 14:02:05]: Thấy thông tin cá nhân', '2024-11-07 07:02:05'),
(355, 1, 'Quản trị viên', 1, '[2024:11:07 14:02:37]: Lấy danh sách quyền hạn', '2024-11-07 07:02:37'),
(356, 1, 'Quản trị viên', 1, '[2024:11:07 14:02:37]: Thấy thông tin cá nhân', '2024-11-07 07:02:37'),
(357, 1, 'Quản trị viên', 1, '[2024:11:07 14:04:01]: Lấy danh sách quyền hạn', '2024-11-07 07:04:01'),
(358, 1, 'Quản trị viên', 1, '[2024:11:07 14:04:01]: Thấy thông tin cá nhân', '2024-11-07 07:04:01'),
(359, 1, 'Quản trị viên', 1, '[2024:11:07 14:04:09]: Lấy danh sách quyền hạn', '2024-11-07 07:04:09'),
(360, 1, 'Quản trị viên', 1, '[2024:11:07 14:04:09]: Thấy thông tin cá nhân', '2024-11-07 07:04:09'),
(361, 1, 'Quản trị viên', 1, '[2024:11:07 14:10:56]: Lấy danh sách quyền hạn', '2024-11-07 07:10:56'),
(362, 1, 'Quản trị viên', 1, '[2024:11:07 14:10:56]: Thấy thông tin cá nhân', '2024-11-07 07:10:56'),
(363, 1, 'Quản trị viên', 1, '[2024:11:07 14:12:27]: Lấy danh sách quyền hạn', '2024-11-07 07:12:27'),
(364, 1, 'Quản trị viên', 1, '[2024:11:07 14:12:27]: Thấy thông tin cá nhân', '2024-11-07 07:12:27'),
(365, 1, 'Quản trị viên', 1, '[2024:11:07 14:16:58]: Lấy danh sách quyền hạn', '2024-11-07 07:16:58'),
(366, 1, 'Quản trị viên', 1, '[2024:11:07 14:16:58]: Thấy thông tin cá nhân', '2024-11-07 07:16:58'),
(367, 1, 'Quản trị viên', 1, '[2024:11:07 14:19:53]: Lấy danh sách quyền hạn', '2024-11-07 07:19:53'),
(368, 1, 'Quản trị viên', 1, '[2024:11:07 14:19:53]: Thấy thông tin cá nhân', '2024-11-07 07:19:53'),
(369, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:06]: Lấy danh sách quyền hạn', '2024-11-07 07:20:06'),
(370, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:06]: Thấy thông tin cá nhân', '2024-11-07 07:20:06'),
(371, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:16]: Lấy danh sách quyền hạn', '2024-11-07 07:20:16'),
(372, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:16]: Thấy thông tin cá nhân', '2024-11-07 07:20:16'),
(373, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:23]: Lấy danh sách quyền hạn', '2024-11-07 07:20:23'),
(374, 1, 'Quản trị viên', 1, '[2024:11:07 14:20:23]: Thấy thông tin cá nhân', '2024-11-07 07:20:23'),
(375, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:07]: Lấy danh sách quyền hạn', '2024-11-07 07:21:07'),
(376, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:07]: Thấy thông tin cá nhân', '2024-11-07 07:21:07'),
(377, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:16]: Lấy danh sách quyền hạn', '2024-11-07 07:21:16'),
(378, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:16]: Thấy thông tin cá nhân', '2024-11-07 07:21:16'),
(379, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:34]: Lấy danh sách quyền hạn', '2024-11-07 07:21:34'),
(380, 1, 'Quản trị viên', 1, '[2024:11:07 14:21:34]: Thấy thông tin cá nhân', '2024-11-07 07:21:34'),
(381, 1, 'Quản trị viên', 1, '[2024:11:07 14:34:32]: Lấy danh sách quyền hạn', '2024-11-07 07:34:32'),
(382, 1, 'Quản trị viên', 1, '[2024:11:07 14:34:32]: Thấy thông tin cá nhân', '2024-11-07 07:34:32'),
(383, 1, 'Quản trị viên', 1, '[2024:11:07 14:34:43]: Lấy danh sách quyền hạn', '2024-11-07 07:34:43'),
(384, 1, 'Quản trị viên', 1, '[2024:11:07 14:34:43]: Thấy thông tin cá nhân', '2024-11-07 07:34:43'),
(385, 1, 'Quản trị viên', 1, '[2024:11:07 14:38:38]: Lấy danh sách quyền hạn', '2024-11-07 07:38:38'),
(386, 1, 'Quản trị viên', 1, '[2024:11:07 14:38:38]: Thấy thông tin cá nhân', '2024-11-07 07:38:38'),
(387, 1, 'Quản trị viên', 1, '[2024:11:07 14:40:21]: Lấy danh sách quyền hạn', '2024-11-07 07:40:21'),
(388, 1, 'Quản trị viên', 1, '[2024:11:07 14:40:21]: Thấy thông tin cá nhân', '2024-11-07 07:40:21'),
(389, 1, 'Quản trị viên', 1, '[2024:11:07 14:41:15]: Lấy danh sách quyền hạn', '2024-11-07 07:41:15'),
(390, 1, 'Quản trị viên', 1, '[2024:11:07 14:41:15]: Thấy thông tin cá nhân', '2024-11-07 07:41:15'),
(391, 1, 'Quản trị viên', 1, '[2024:11:07 14:45:39]: Lấy danh sách quyền hạn', '2024-11-07 07:45:39'),
(392, 1, 'Quản trị viên', 1, '[2024:11:07 14:45:39]: Thấy thông tin cá nhân', '2024-11-07 07:45:39'),
(393, 1, 'Quản trị viên', 1, '[2024:11:07 14:46:12]: Lấy danh sách quyền hạn', '2024-11-07 07:46:12'),
(394, 1, 'Quản trị viên', 1, '[2024:11:07 14:46:12]: Thấy thông tin cá nhân', '2024-11-07 07:46:12'),
(395, 1, 'Quản trị viên', 1, '[2024:11:07 14:46:54]: Lấy danh sách quyền hạn', '2024-11-07 07:46:54'),
(396, 1, 'Quản trị viên', 1, '[2024:11:07 14:46:54]: Thấy thông tin cá nhân', '2024-11-07 07:46:54'),
(397, 1, 'Quản trị viên', 1, '[2024:11:07 14:47:14]: Lấy danh sách quyền hạn', '2024-11-07 07:47:14'),
(398, 1, 'Quản trị viên', 1, '[2024:11:07 14:47:14]: Thấy thông tin cá nhân', '2024-11-07 07:47:14'),
(399, 1, 'Quản trị viên', 1, '[2024:11:07 14:47:59]: Lấy danh sách quyền hạn', '2024-11-07 07:47:59'),
(400, 1, 'Quản trị viên', 1, '[2024:11:07 14:47:59]: Thấy thông tin cá nhân', '2024-11-07 07:47:59'),
(401, 1, 'Quản trị viên', 1, '[2024:11:07 14:49:48]: Lấy danh sách quyền hạn', '2024-11-07 07:49:48'),
(402, 1, 'Quản trị viên', 1, '[2024:11:07 14:49:48]: Thấy thông tin cá nhân', '2024-11-07 07:49:48'),
(403, 1, 'Quản trị viên', 1, '[2024:11:07 14:50:25]: Lấy danh sách quyền hạn', '2024-11-07 07:50:25'),
(404, 1, 'Quản trị viên', 1, '[2024:11:07 14:50:25]: Thấy thông tin cá nhân', '2024-11-07 07:50:25'),
(405, 1, 'Quản trị viên', 1, '[2024:11:07 14:51:51]: Lấy danh sách quyền hạn', '2024-11-07 07:51:51'),
(406, 1, 'Quản trị viên', 1, '[2024:11:07 14:51:51]: Thấy thông tin cá nhân', '2024-11-07 07:51:51'),
(407, 1, 'Quản trị viên', 1, '[2024:11:07 14:52:00]: Lấy danh sách quyền hạn', '2024-11-07 07:52:00'),
(408, 1, 'Quản trị viên', 1, '[2024:11:07 14:52:00]: Thấy thông tin cá nhân', '2024-11-07 07:52:00'),
(409, 1, 'Quản trị viên', 1, '[2024:11:07 14:56:44]: Lấy danh sách quyền hạn', '2024-11-07 07:56:44'),
(410, 1, 'Quản trị viên', 1, '[2024:11:07 14:56:44]: Thấy thông tin cá nhân', '2024-11-07 07:56:44'),
(411, 1, 'Quản trị viên', 1, '[2024:11:07 15:00:16]: Lấy danh sách quyền hạn', '2024-11-07 08:00:16'),
(412, 1, 'Quản trị viên', 1, '[2024:11:07 15:00:16]: Thấy thông tin cá nhân', '2024-11-07 08:00:16'),
(413, 1, 'Quản trị viên', 1, '[2024:11:07 15:00:38]: Lấy danh sách quyền hạn', '2024-11-07 08:00:38'),
(414, 1, 'Quản trị viên', 1, '[2024:11:07 15:00:38]: Thấy thông tin cá nhân', '2024-11-07 08:00:38'),
(415, 1, 'Quản trị viên', 1, '[2024:11:07 15:01:20]: Lấy danh sách quyền hạn', '2024-11-07 08:01:20'),
(416, 1, 'Quản trị viên', 1, '[2024:11:07 15:01:20]: Thấy thông tin cá nhân', '2024-11-07 08:01:20'),
(417, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:11]: Lấy danh sách quyền hạn', '2024-11-07 08:02:11'),
(418, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:11]: Thấy thông tin cá nhân', '2024-11-07 08:02:11'),
(419, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:22]: Lấy danh sách quyền hạn', '2024-11-07 08:02:22'),
(420, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:22]: Thấy thông tin cá nhân', '2024-11-07 08:02:22'),
(421, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:35]: Lấy danh sách quyền hạn', '2024-11-07 08:02:35'),
(422, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:35]: Thấy thông tin cá nhân', '2024-11-07 08:02:35'),
(423, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:43]: Lấy danh sách quyền hạn', '2024-11-07 08:02:43'),
(424, 1, 'Quản trị viên', 1, '[2024:11:07 15:02:43]: Thấy thông tin cá nhân', '2024-11-07 08:02:43'),
(425, 1, 'Quản trị viên', 1, '[2024:11:07 15:03:29]: Lấy danh sách quyền hạn', '2024-11-07 08:03:29'),
(426, 1, 'Quản trị viên', 1, '[2024:11:07 15:03:29]: Thấy thông tin cá nhân', '2024-11-07 08:03:29'),
(427, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:12]: Lấy danh sách quyền hạn', '2024-11-07 08:04:12'),
(428, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:12]: Thấy thông tin cá nhân', '2024-11-07 08:04:12'),
(429, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:33]: Lấy danh sách quyền hạn', '2024-11-07 08:04:33'),
(430, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:33]: Thấy thông tin cá nhân', '2024-11-07 08:04:33'),
(431, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:47]: Lấy danh sách quyền hạn', '2024-11-07 08:04:47'),
(432, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:47]: Thấy thông tin cá nhân', '2024-11-07 08:04:47'),
(433, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:55]: Lấy danh sách quyền hạn', '2024-11-07 08:04:55'),
(434, 1, 'Quản trị viên', 1, '[2024:11:07 15:04:55]: Thấy thông tin cá nhân', '2024-11-07 08:04:55'),
(435, 1, 'Quản trị viên', 1, '[2024:11:07 15:06:33]: Lấy danh sách quyền hạn', '2024-11-07 08:06:33'),
(436, 1, 'Quản trị viên', 1, '[2024:11:07 15:06:33]: Thấy thông tin cá nhân', '2024-11-07 08:06:33'),
(437, 1, 'Quản trị viên', 1, '[2024:11:07 15:08:12]: Lấy danh sách quyền hạn', '2024-11-07 08:08:12'),
(438, 1, 'Quản trị viên', 1, '[2024:11:07 15:08:12]: Thấy thông tin cá nhân', '2024-11-07 08:08:12'),
(439, 1, 'Quản trị viên', 1, '[2024:11:07 15:08:30]: Lấy danh sách quyền hạn', '2024-11-07 08:08:30'),
(440, 1, 'Quản trị viên', 1, '[2024:11:07 15:08:30]: Thấy thông tin cá nhân', '2024-11-07 08:08:30'),
(441, 1, 'Quản trị viên', 1, '[2024:11:07 15:14:38]: Lấy danh sách quyền hạn', '2024-11-07 08:14:38'),
(442, 1, 'Quản trị viên', 1, '[2024:11:07 15:14:38]: Thấy thông tin cá nhân', '2024-11-07 08:14:38'),
(443, 1, 'Quản trị viên', 1, '[2024:11:07 15:14:43]: Lấy danh sách quyền hạn', '2024-11-07 08:14:43'),
(444, 1, 'Quản trị viên', 1, '[2024:11:07 15:14:43]: Thấy thông tin cá nhân', '2024-11-07 08:14:43'),
(445, 1, 'Quản trị viên', 1, '[2024:11:07 15:15:23]: Lấy danh sách quyền hạn', '2024-11-07 08:15:23'),
(446, 1, 'Quản trị viên', 1, '[2024:11:07 15:15:23]: Thấy thông tin cá nhân', '2024-11-07 08:15:23'),
(447, 1, 'Quản trị viên', 1, '[2024:11:07 15:15:28]: Lấy danh sách quyền hạn', '2024-11-07 08:15:28'),
(448, 1, 'Quản trị viên', 1, '[2024:11:07 15:15:28]: Thấy thông tin cá nhân', '2024-11-07 08:15:28'),
(449, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:03]: Lấy danh sách quyền hạn', '2024-11-07 08:34:03'),
(450, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:03]: Thấy thông tin cá nhân', '2024-11-07 08:34:03'),
(451, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:30]: Lấy danh sách quyền hạn', '2024-11-07 08:34:30'),
(452, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:30]: Thấy thông tin cá nhân', '2024-11-07 08:34:30'),
(453, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:51]: Lấy danh sách quyền hạn', '2024-11-07 08:34:51'),
(454, 1, 'Quản trị viên', 1, '[2024:11:07 15:34:51]: Thấy thông tin cá nhân', '2024-11-07 08:34:51'),
(455, 1, 'Quản trị viên', 1, '[2024:11:07 15:35:51]: Lấy danh sách quyền hạn', '2024-11-07 08:35:51'),
(456, 1, 'Quản trị viên', 1, '[2024:11:07 15:35:51]: Thấy thông tin cá nhân', '2024-11-07 08:35:51'),
(457, 1, 'Quản trị viên', 1, '[2024:11:07 15:39:10]: Lấy danh sách quyền hạn', '2024-11-07 08:39:10'),
(458, 1, 'Quản trị viên', 1, '[2024:11:07 15:39:11]: Thấy thông tin cá nhân', '2024-11-07 08:39:10'),
(459, 1, 'Quản trị viên', 1, '[2024:11:07 15:43:34]: Lấy danh sách quyền hạn', '2024-11-07 08:43:34'),
(460, 1, 'Quản trị viên', 1, '[2024:11:07 15:43:34]: Thấy thông tin cá nhân', '2024-11-07 08:43:34'),
(461, 1, 'Quản trị viên', 1, '[2024:11:07 15:46:49]: Lấy danh sách quyền hạn', '2024-11-07 08:46:49'),
(462, 1, 'Quản trị viên', 1, '[2024:11:07 15:46:49]: Thấy thông tin cá nhân', '2024-11-07 08:46:49'),
(463, 1, 'Quản trị viên', 1, '[2024:11:07 15:48:06]: Lấy danh sách quyền hạn', '2024-11-07 08:48:06'),
(464, 1, 'Quản trị viên', 1, '[2024:11:07 15:48:06]: Thấy thông tin cá nhân', '2024-11-07 08:48:06'),
(465, 1, 'Quản trị viên', 1, '[2024:11:07 15:50:04]: Lấy danh sách quyền hạn', '2024-11-07 08:50:04'),
(466, 1, 'Quản trị viên', 1, '[2024:11:07 15:50:04]: Thấy thông tin cá nhân', '2024-11-07 08:50:04'),
(467, 1, 'Quản trị viên', 1, '[2024:11:07 15:53:58]: Lấy danh sách quyền hạn', '2024-11-07 08:53:58'),
(468, 1, 'Quản trị viên', 1, '[2024:11:07 15:53:58]: Thấy thông tin cá nhân', '2024-11-07 08:53:58'),
(469, 1, 'Quản trị viên', 1, '[2024:11:07 15:55:26]: Lấy danh sách quyền hạn', '2024-11-07 08:55:26'),
(470, 1, 'Quản trị viên', 1, '[2024:11:07 15:55:26]: Thấy thông tin cá nhân', '2024-11-07 08:55:26'),
(471, 1, 'Quản trị viên', 1, '[2024:11:07 15:56:01]: Lấy danh sách quyền hạn', '2024-11-07 08:56:01'),
(472, 1, 'Quản trị viên', 1, '[2024:11:07 15:56:01]: Thấy thông tin cá nhân', '2024-11-07 08:56:01'),
(473, 1, 'Quản trị viên', 1, '[2024:11:07 15:57:03]: Lấy danh sách quyền hạn', '2024-11-07 08:57:03'),
(474, 1, 'Quản trị viên', 1, '[2024:11:07 15:57:03]: Thấy thông tin cá nhân', '2024-11-07 08:57:03'),
(475, 1, 'Quản trị viên', 1, '[2024:11:07 15:57:31]: Lấy danh sách quyền hạn', '2024-11-07 08:57:31'),
(476, 1, 'Quản trị viên', 1, '[2024:11:07 15:57:31]: Thấy thông tin cá nhân', '2024-11-07 08:57:31'),
(477, 1, 'Quản trị viên', 1, '[2024:11:07 15:59:24]: Lấy danh sách quyền hạn', '2024-11-07 08:59:24'),
(478, 1, 'Quản trị viên', 1, '[2024:11:07 15:59:25]: Thấy thông tin cá nhân', '2024-11-07 08:59:24'),
(479, 1, 'Quản trị viên', 1, '[2024:11:07 16:06:20]: Lấy danh sách quyền hạn', '2024-11-07 09:06:20'),
(480, 1, 'Quản trị viên', 1, '[2024:11:07 16:06:20]: Thấy thông tin cá nhân', '2024-11-07 09:06:20'),
(481, 1, 'Quản trị viên', 1, '[2024:11:07 16:07:27]: Lấy danh sách quyền hạn', '2024-11-07 09:07:27'),
(482, 1, 'Quản trị viên', 1, '[2024:11:07 16:07:27]: Thấy thông tin cá nhân', '2024-11-07 09:07:27'),
(483, 1, 'Quản trị viên', 1, '[2024:11:07 16:10:57]: Lấy danh sách quyền hạn', '2024-11-07 09:10:57'),
(484, 1, 'Quản trị viên', 1, '[2024:11:07 16:10:57]: Thấy thông tin cá nhân', '2024-11-07 09:10:57'),
(485, 1, 'Quản trị viên', 1, '[2024:11:07 16:15:43]: Lấy danh sách quyền hạn', '2024-11-07 09:15:42'),
(486, 1, 'Quản trị viên', 1, '[2024:11:07 16:15:43]: Thấy thông tin cá nhân', '2024-11-07 09:15:42'),
(487, 1, 'Quản trị viên', 1, '[2024:11:07 16:20:33]: Lấy danh sách quyền hạn', '2024-11-07 09:20:33'),
(488, 1, 'Quản trị viên', 1, '[2024:11:07 16:20:33]: Thấy thông tin cá nhân', '2024-11-07 09:20:33'),
(489, 1, 'Quản trị viên', 1, '[2024:11:07 16:20:46]: Lấy danh sách quyền hạn', '2024-11-07 09:20:46'),
(490, 1, 'Quản trị viên', 1, '[2024:11:07 16:20:46]: Thấy thông tin cá nhân', '2024-11-07 09:20:46'),
(491, 1, 'Quản trị viên', 1, '[2024:11:07 16:21:36]: Lấy danh sách quyền hạn', '2024-11-07 09:21:36'),
(492, 1, 'Quản trị viên', 1, '[2024:11:07 16:21:36]: Thấy thông tin cá nhân', '2024-11-07 09:21:36'),
(493, 1, 'Quản trị viên', 1, '[2024:11:07 16:25:39]: Lấy danh sách quyền hạn', '2024-11-07 09:25:39'),
(494, 1, 'Quản trị viên', 1, '[2024:11:07 16:25:39]: Thấy thông tin cá nhân', '2024-11-07 09:25:39'),
(495, 1, 'Quản trị viên', 1, '[2024:11:07 16:26:17]: Lấy danh sách quyền hạn', '2024-11-07 09:26:17'),
(496, 1, 'Quản trị viên', 1, '[2024:11:07 16:26:17]: Thấy thông tin cá nhân', '2024-11-07 09:26:17'),
(497, 1, 'Quản trị viên', 1, '[2024:11:07 16:27:19]: Lấy danh sách quyền hạn', '2024-11-07 09:27:19'),
(498, 1, 'Quản trị viên', 1, '[2024:11:07 16:27:19]: Thấy thông tin cá nhân', '2024-11-07 09:27:19'),
(499, 1, 'Quản trị viên', 1, '[2024:11:07 16:28:40]: Lấy danh sách quyền hạn', '2024-11-07 09:28:40'),
(500, 1, 'Quản trị viên', 1, '[2024:11:07 16:28:40]: Thấy thông tin cá nhân', '2024-11-07 09:28:40'),
(501, 1, 'Quản trị viên', 1, '[2024:11:07 16:28:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:28:40'),
(502, 1, 'Quản trị viên', 1, '[2024:11:07 16:29:03]: Lấy danh sách quyền hạn', '2024-11-07 09:29:03'),
(503, 1, 'Quản trị viên', 1, '[2024:11:07 16:29:03]: Thấy thông tin cá nhân', '2024-11-07 09:29:03'),
(504, 1, 'Quản trị viên', 1, '[2024:11:07 16:29:03]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:29:03'),
(505, 1, 'Quản trị viên', 1, '[2024:11:07 16:33:40]: Lấy danh sách quyền hạn', '2024-11-07 09:33:40'),
(506, 1, 'Quản trị viên', 1, '[2024:11:07 16:33:40]: Thấy thông tin cá nhân', '2024-11-07 09:33:40'),
(507, 1, 'Quản trị viên', 1, '[2024:11:07 16:33:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:33:40'),
(508, 1, 'Quản trị viên', 1, '[2024:11:07 16:34:51]: Lấy danh sách quyền hạn', '2024-11-07 09:34:51'),
(509, 1, 'Quản trị viên', 1, '[2024:11:07 16:34:51]: Thấy thông tin cá nhân', '2024-11-07 09:34:51'),
(510, 1, 'Quản trị viên', 1, '[2024:11:07 16:34:51]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:34:51'),
(511, 1, 'Quản trị viên', 1, '[2024:11:07 16:35:57]: Lấy danh sách quyền hạn', '2024-11-07 09:35:57'),
(512, 1, 'Quản trị viên', 1, '[2024:11:07 16:35:57]: Thấy thông tin cá nhân', '2024-11-07 09:35:57'),
(513, 1, 'Quản trị viên', 1, '[2024:11:07 16:35:57]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:35:57'),
(514, 1, 'Quản trị viên', 1, '[2024:11:07 16:45:16]: Lấy danh sách quyền hạn', '2024-11-07 09:45:16'),
(515, 1, 'Quản trị viên', 1, '[2024:11:07 16:45:16]: Thấy thông tin cá nhân', '2024-11-07 09:45:16'),
(516, 1, 'Quản trị viên', 1, '[2024:11:07 16:45:16]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:45:16'),
(517, 1, 'Quản trị viên', 1, '[2024:11:07 16:46:59]: Lấy danh sách quyền hạn', '2024-11-07 09:46:59'),
(518, 1, 'Quản trị viên', 1, '[2024:11:07 16:46:59]: Thấy thông tin cá nhân', '2024-11-07 09:46:59'),
(519, 1, 'Quản trị viên', 1, '[2024:11:07 16:46:59]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:46:59'),
(520, 1, 'Quản trị viên', 1, '[2024:11:07 16:49:50]: Lấy danh sách quyền hạn', '2024-11-07 09:49:50'),
(521, 1, 'Quản trị viên', 1, '[2024:11:07 16:49:50]: Thấy thông tin cá nhân', '2024-11-07 09:49:50'),
(522, 1, 'Quản trị viên', 1, '[2024:11:07 16:49:50]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:49:50'),
(523, 1, 'Quản trị viên', 1, '[2024:11:07 16:50:35]: Lấy danh sách quyền hạn', '2024-11-07 09:50:35'),
(524, 1, 'Quản trị viên', 1, '[2024:11:07 16:50:35]: Thấy thông tin cá nhân', '2024-11-07 09:50:35'),
(525, 1, 'Quản trị viên', 1, '[2024:11:07 16:50:35]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:50:35'),
(526, 1, 'Quản trị viên', 1, '[2024:11:07 16:52:26]: Lấy danh sách quyền hạn', '2024-11-07 09:52:26'),
(527, 1, 'Quản trị viên', 1, '[2024:11:07 16:52:26]: Thấy thông tin cá nhân', '2024-11-07 09:52:26'),
(528, 1, 'Quản trị viên', 1, '[2024:11:07 16:52:26]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:52:26'),
(529, 1, 'Quản trị viên', 1, '[2024:11:07 16:53:02]: Lấy danh sách quyền hạn', '2024-11-07 09:53:02'),
(530, 1, 'Quản trị viên', 1, '[2024:11:07 16:53:02]: Thấy thông tin cá nhân', '2024-11-07 09:53:02'),
(531, 1, 'Quản trị viên', 1, '[2024:11:07 16:53:02]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 09:53:02'),
(532, 1, 'Quản trị viên', 1, '[2024:11:07 17:04:25]: Lấy danh sách quyền hạn', '2024-11-07 10:04:25');
INSERT INTO `logs` (`id`, `user_id`, `action`, `status`, `detail`, `created_at`) VALUES
(533, 1, 'Quản trị viên', 1, '[2024:11:07 17:04:26]: Thấy thông tin cá nhân', '2024-11-07 10:04:25'),
(534, 1, 'Quản trị viên', 1, '[2024:11:07 17:04:26]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:04:26'),
(535, 1, 'Quản trị viên', 1, '[2024:11:07 17:05:56]: Lấy danh sách quyền hạn', '2024-11-07 10:05:55'),
(536, 1, 'Quản trị viên', 1, '[2024:11:07 17:05:56]: Thấy thông tin cá nhân', '2024-11-07 10:05:55'),
(537, 1, 'Quản trị viên', 1, '[2024:11:07 17:05:56]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:05:56'),
(538, 1, 'Quản trị viên', 1, '[2024:11:07 17:15:32]: Lấy danh sách quyền hạn', '2024-11-07 10:15:32'),
(539, 1, 'Quản trị viên', 1, '[2024:11:07 17:15:32]: Thấy thông tin cá nhân', '2024-11-07 10:15:32'),
(540, 1, 'Quản trị viên', 1, '[2024:11:07 17:15:32]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:15:32'),
(541, 1, 'Quản trị viên', 1, '[2024:11:07 17:16:15]: Lấy danh sách quyền hạn', '2024-11-07 10:16:15'),
(542, 1, 'Quản trị viên', 1, '[2024:11:07 17:16:15]: Thấy thông tin cá nhân', '2024-11-07 10:16:15'),
(543, 1, 'Quản trị viên', 1, '[2024:11:07 17:16:15]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:16:15'),
(544, 1, 'Quản trị viên', 1, '[2024:11:07 17:24:53]: Lấy danh sách quyền hạn', '2024-11-07 10:24:53'),
(545, 1, 'Quản trị viên', 1, '[2024:11:07 17:24:53]: Thấy thông tin cá nhân', '2024-11-07 10:24:53'),
(546, 1, 'Quản trị viên', 1, '[2024:11:07 17:24:54]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:24:54'),
(547, 1, 'Tạo chủ đề bài tập hệ thống', 0, '[2024:11:07 17:25:13]: Trường chỉnh sửa không hợp lệ. Phải là 0 hoặc 1.', '2024-11-07 10:25:13'),
(548, 1, 'Tạo chủ đề bài tập hệ thống', 0, '', '2024-11-07 10:28:20'),
(549, 1, 'Tạo chủ đề bài tập hệ thống', 1, '[2024:11:07 17:28:56]: Tạo chủ đề mới thành công.', '2024-11-07 10:28:56'),
(550, 1, 'Quản trị viên', 1, '[2024:11:07 17:50:19]: Lấy danh sách quyền hạn', '2024-11-07 10:50:19'),
(551, 1, 'Quản trị viên', 1, '[2024:11:07 17:50:19]: Thấy thông tin cá nhân', '2024-11-07 10:50:19'),
(552, 1, 'Quản trị viên', 1, '[2024:11:07 17:50:19]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:50:19'),
(553, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:01]: Lấy danh sách quyền hạn', '2024-11-07 10:51:01'),
(554, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:01]: Thấy thông tin cá nhân', '2024-11-07 10:51:01'),
(555, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:02]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:51:02'),
(556, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:28]: Lấy danh sách quyền hạn', '2024-11-07 10:51:28'),
(557, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:28]: Thấy thông tin cá nhân', '2024-11-07 10:51:28'),
(558, 1, 'Quản trị viên', 1, '[2024:11:07 17:51:28]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:51:28'),
(559, 1, 'Quản trị viên', 1, '[2024:11:07 17:54:30]: Lấy danh sách quyền hạn', '2024-11-07 10:54:30'),
(560, 1, 'Quản trị viên', 1, '[2024:11:07 17:54:30]: Thấy thông tin cá nhân', '2024-11-07 10:54:30'),
(561, 1, 'Quản trị viên', 1, '[2024:11:07 17:54:30]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:54:30'),
(562, 1, 'Quản trị viên', 1, '[2024:11:07 17:55:17]: Lấy danh sách quyền hạn', '2024-11-07 10:55:17'),
(563, 1, 'Quản trị viên', 1, '[2024:11:07 17:55:17]: Thấy thông tin cá nhân', '2024-11-07 10:55:17'),
(564, 1, 'Quản trị viên', 1, '[2024:11:07 17:55:18]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 10:55:18'),
(565, 1, 'Quản trị viên', 1, '[2024:11:07 18:03:53]: Lấy danh sách quyền hạn', '2024-11-07 11:03:53'),
(566, 1, 'Quản trị viên', 1, '[2024:11:07 18:03:53]: Thấy thông tin cá nhân', '2024-11-07 11:03:53'),
(567, 1, 'Quản trị viên', 1, '[2024:11:07 18:03:53]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:03:53'),
(568, 1, 'Tạo chủ đề bài tập hệ thống', 1, '[2024:11:07 18:42:42]: Tạo chủ đề mới thành công.', '2024-11-07 11:42:42'),
(569, 1, 'Quản trị viên', 1, '[2024:11:07 18:44:31]: Lấy danh sách quyền hạn', '2024-11-07 11:44:31'),
(570, 1, 'Quản trị viên', 1, '[2024:11:07 18:44:31]: Thấy thông tin cá nhân', '2024-11-07 11:44:31'),
(571, 1, 'Quản trị viên', 1, '[2024:11:07 18:44:31]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:44:31'),
(572, 1, 'Quản trị viên', 1, '[2024:11:07 18:45:02]: Lấy danh sách quyền hạn', '2024-11-07 11:45:02'),
(573, 1, 'Quản trị viên', 1, '[2024:11:07 18:45:02]: Thấy thông tin cá nhân', '2024-11-07 11:45:02'),
(574, 1, 'Quản trị viên', 1, '[2024:11:07 18:45:02]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:45:02'),
(575, 1, 'Quản trị viên', 1, '[2024:11:07 18:51:42]: Thấy thông tin cá nhân', '2024-11-07 11:51:42'),
(576, 1, 'Quản trị viên', 1, '[2024:11:07 18:51:42]: Lấy danh sách quyền hạn', '2024-11-07 11:51:42'),
(577, 1, 'Quản trị viên', 1, '[2024:11:07 18:51:42]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:51:42'),
(578, 1, 'Quản trị viên', 1, '[2024:11:07 18:54:11]: Lấy danh sách quyền hạn', '2024-11-07 11:54:11'),
(579, 1, 'Quản trị viên', 1, '[2024:11:07 18:54:11]: Thấy thông tin cá nhân', '2024-11-07 11:54:11'),
(580, 1, 'Quản trị viên', 1, '[2024:11:07 18:54:12]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:54:12'),
(581, 1, 'Quản trị viên', 1, '[2024:11:07 18:56:09]: Lấy danh sách quyền hạn', '2024-11-07 11:56:09'),
(582, 1, 'Quản trị viên', 1, '[2024:11:07 18:56:09]: Thấy thông tin cá nhân', '2024-11-07 11:56:09'),
(583, 1, 'Quản trị viên', 1, '[2024:11:07 18:56:09]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:56:09'),
(584, 1, 'Quản trị viên', 1, '[2024:11:07 18:57:18]: Lấy danh sách quyền hạn', '2024-11-07 11:57:18'),
(585, 1, 'Quản trị viên', 1, '[2024:11:07 18:57:18]: Thấy thông tin cá nhân', '2024-11-07 11:57:18'),
(586, 1, 'Quản trị viên', 1, '[2024:11:07 18:57:18]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 11:57:18'),
(587, 1, 'Quản trị viên', 1, '[2024:11:07 19:00:45]: Lấy danh sách quyền hạn', '2024-11-07 12:00:45'),
(588, 1, 'Quản trị viên', 1, '[2024:11:07 19:00:45]: Thấy thông tin cá nhân', '2024-11-07 12:00:45'),
(589, 1, 'Quản trị viên', 1, '[2024:11:07 19:00:45]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:00:45'),
(590, 1, 'Quản trị viên', 1, '[2024:11:07 19:04:48]: Lấy danh sách quyền hạn', '2024-11-07 12:04:48'),
(591, 1, 'Quản trị viên', 1, '[2024:11:07 19:04:48]: Thấy thông tin cá nhân', '2024-11-07 12:04:48'),
(592, 1, 'Quản trị viên', 1, '[2024:11:07 19:04:48]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:04:48'),
(593, 1, 'Quản trị viên', 1, '[2024:11:07 19:06:24]: Lấy danh sách quyền hạn', '2024-11-07 12:06:24'),
(594, 1, 'Quản trị viên', 1, '[2024:11:07 19:06:24]: Thấy thông tin cá nhân', '2024-11-07 12:06:24'),
(595, 1, 'Quản trị viên', 1, '[2024:11:07 19:06:25]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:06:25'),
(596, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:23]: Lấy danh sách quyền hạn', '2024-11-07 12:07:23'),
(597, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:23]: Thấy thông tin cá nhân', '2024-11-07 12:07:23'),
(598, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:23]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:07:23'),
(599, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:33]: Lấy danh sách quyền hạn', '2024-11-07 12:07:33'),
(600, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:33]: Thấy thông tin cá nhân', '2024-11-07 12:07:33'),
(601, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:33]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:07:33'),
(602, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:50]: Lấy danh sách quyền hạn', '2024-11-07 12:07:50'),
(603, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:50]: Thấy thông tin cá nhân', '2024-11-07 12:07:50'),
(604, 1, 'Quản trị viên', 1, '[2024:11:07 19:07:50]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:07:50'),
(605, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:15]: Lấy danh sách quyền hạn', '2024-11-07 12:08:15'),
(606, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:15]: Thấy thông tin cá nhân', '2024-11-07 12:08:15'),
(607, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:15]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:08:15'),
(608, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:50]: Lấy danh sách quyền hạn', '2024-11-07 12:08:50'),
(609, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:50]: Thấy thông tin cá nhân', '2024-11-07 12:08:50'),
(610, 1, 'Quản trị viên', 1, '[2024:11:07 19:08:51]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:08:51'),
(611, 1, 'Quản trị viên', 1, '[2024:11:07 19:09:05]: Lấy danh sách quyền hạn', '2024-11-07 12:09:05'),
(612, 1, 'Quản trị viên', 1, '[2024:11:07 19:09:05]: Thấy thông tin cá nhân', '2024-11-07 12:09:05'),
(613, 1, 'Quản trị viên', 1, '[2024:11:07 19:09:05]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:09:05'),
(614, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:06]: Lấy danh sách quyền hạn', '2024-11-07 12:12:06'),
(615, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:06]: Thấy thông tin cá nhân', '2024-11-07 12:12:06'),
(616, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:07]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:12:07'),
(617, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:45]: Lấy danh sách quyền hạn', '2024-11-07 12:12:45'),
(618, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:45]: Thấy thông tin cá nhân', '2024-11-07 12:12:45'),
(619, 1, 'Quản trị viên', 1, '[2024:11:07 19:12:45]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:12:45'),
(620, 1, 'Quản trị viên', 1, '[2024:11:07 19:13:55]: Lấy danh sách quyền hạn', '2024-11-07 12:13:55'),
(621, 1, 'Quản trị viên', 1, '[2024:11:07 19:13:55]: Thấy thông tin cá nhân', '2024-11-07 12:13:55'),
(622, 1, 'Quản trị viên', 1, '[2024:11:07 19:13:55]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:13:55'),
(623, 1, 'Quản trị viên', 1, '[2024:11:07 19:24:31]: Lấy danh sách quyền hạn', '2024-11-07 12:24:31'),
(624, 1, 'Quản trị viên', 1, '[2024:11:07 19:24:31]: Thấy thông tin cá nhân', '2024-11-07 12:24:31'),
(625, 1, 'Quản trị viên', 1, '[2024:11:07 19:24:31]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:24:31'),
(626, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:07]: Lấy danh sách quyền hạn', '2024-11-07 12:25:07'),
(627, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:07]: Thấy thông tin cá nhân', '2024-11-07 12:25:07'),
(628, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:07]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:25:07'),
(629, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:21]: Lấy danh sách quyền hạn', '2024-11-07 12:25:21'),
(630, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:21]: Thấy thông tin cá nhân', '2024-11-07 12:25:21'),
(631, 1, 'Quản trị viên', 1, '[2024:11:07 19:25:21]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:25:21'),
(632, 1, 'Quản trị viên', 1, '[2024:11:07 19:26:10]: Lấy danh sách quyền hạn', '2024-11-07 12:26:10'),
(633, 1, 'Quản trị viên', 1, '[2024:11:07 19:26:10]: Thấy thông tin cá nhân', '2024-11-07 12:26:10'),
(634, 1, 'Quản trị viên', 1, '[2024:11:07 19:26:10]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:26:10'),
(635, 1, 'Quản trị viên', 1, '[2024:11:07 19:27:47]: Lấy danh sách quyền hạn', '2024-11-07 12:27:47'),
(636, 1, 'Quản trị viên', 1, '[2024:11:07 19:27:47]: Thấy thông tin cá nhân', '2024-11-07 12:27:47'),
(637, 1, 'Quản trị viên', 1, '[2024:11:07 19:27:47]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:27:47'),
(638, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:00]: Lấy danh sách quyền hạn', '2024-11-07 12:28:00'),
(639, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:00]: Thấy thông tin cá nhân', '2024-11-07 12:28:00'),
(640, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:00]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:28:00'),
(641, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:25]: Lấy danh sách quyền hạn', '2024-11-07 12:28:25'),
(642, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:25]: Thấy thông tin cá nhân', '2024-11-07 12:28:25'),
(643, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:25]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:28:25'),
(644, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:40]: Lấy danh sách quyền hạn', '2024-11-07 12:28:40'),
(645, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:40]: Thấy thông tin cá nhân', '2024-11-07 12:28:40'),
(646, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:28:40'),
(647, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:57]: Lấy danh sách quyền hạn', '2024-11-07 12:28:57'),
(648, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:57]: Thấy thông tin cá nhân', '2024-11-07 12:28:57'),
(649, 1, 'Quản trị viên', 1, '[2024:11:07 19:28:58]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:28:58'),
(650, 1, 'Quản trị viên', 1, '[2024:11:07 19:30:27]: Lấy danh sách quyền hạn', '2024-11-07 12:30:27'),
(651, 1, 'Quản trị viên', 1, '[2024:11:07 19:30:27]: Thấy thông tin cá nhân', '2024-11-07 12:30:27'),
(652, 1, 'Quản trị viên', 1, '[2024:11:07 19:30:27]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 12:30:27'),
(653, 1, 'Quản trị viên', 1, '[2024:11:07 20:03:51]: Lấy danh sách quyền hạn', '2024-11-07 13:03:51'),
(654, 1, 'Quản trị viên', 1, '[2024:11:07 20:03:51]: Thấy thông tin cá nhân', '2024-11-07 13:03:51'),
(655, 1, 'Quản trị viên', 1, '[2024:11:07 20:03:51]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:03:51'),
(656, 1, 'Quản trị viên', 1, '[2024:11:07 20:06:12]: Lấy danh sách quyền hạn', '2024-11-07 13:06:12'),
(657, 1, 'Quản trị viên', 1, '[2024:11:07 20:06:12]: Thấy thông tin cá nhân', '2024-11-07 13:06:12'),
(658, 1, 'Quản trị viên', 1, '[2024:11:07 20:06:13]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:06:13'),
(659, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:32]: Lấy danh sách quyền hạn', '2024-11-07 13:07:32'),
(660, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:32]: Thấy thông tin cá nhân', '2024-11-07 13:07:32'),
(661, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:32]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:07:32'),
(662, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:42]: Lấy danh sách quyền hạn', '2024-11-07 13:07:42'),
(663, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:42]: Thấy thông tin cá nhân', '2024-11-07 13:07:42'),
(664, 1, 'Quản trị viên', 1, '[2024:11:07 20:07:43]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:07:43'),
(665, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:02]: Lấy danh sách quyền hạn', '2024-11-07 13:08:01'),
(666, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:02]: Thấy thông tin cá nhân', '2024-11-07 13:08:02'),
(667, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:02]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:08:02'),
(668, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:50]: Lấy danh sách quyền hạn', '2024-11-07 13:08:50'),
(669, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:50]: Thấy thông tin cá nhân', '2024-11-07 13:08:50'),
(670, 1, 'Quản trị viên', 1, '[2024:11:07 20:08:50]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:08:50'),
(671, 1, 'Quản trị viên', 1, '[2024:11:07 20:09:44]: Lấy danh sách quyền hạn', '2024-11-07 13:09:44'),
(672, 1, 'Quản trị viên', 1, '[2024:11:07 20:09:44]: Thấy thông tin cá nhân', '2024-11-07 13:09:44'),
(673, 1, 'Quản trị viên', 1, '[2024:11:07 20:09:44]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:09:44'),
(674, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:10]: Lấy danh sách quyền hạn', '2024-11-07 13:10:10'),
(675, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:10]: Thấy thông tin cá nhân', '2024-11-07 13:10:10'),
(676, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:10]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:10:10'),
(677, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:22]: Lấy danh sách quyền hạn', '2024-11-07 13:10:22'),
(678, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:22]: Thấy thông tin cá nhân', '2024-11-07 13:10:22'),
(679, 1, 'Quản trị viên', 1, '[2024:11:07 20:10:22]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:10:22'),
(680, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:07]: Lấy danh sách quyền hạn', '2024-11-07 13:14:07'),
(681, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:07]: Thấy thông tin cá nhân', '2024-11-07 13:14:07'),
(682, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:07]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:14:07'),
(683, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:45]: Lấy danh sách quyền hạn', '2024-11-07 13:14:45'),
(684, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:45]: Thấy thông tin cá nhân', '2024-11-07 13:14:45'),
(685, 1, 'Quản trị viên', 1, '[2024:11:07 20:14:45]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:14:45'),
(686, 1, 'Quản trị viên', 1, '[2024:11:07 20:15:24]: Lấy danh sách quyền hạn', '2024-11-07 13:15:24'),
(687, 1, 'Quản trị viên', 1, '[2024:11:07 20:15:24]: Thấy thông tin cá nhân', '2024-11-07 13:15:24'),
(688, 1, 'Quản trị viên', 1, '[2024:11:07 20:15:24]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:15:24'),
(689, 1, 'Quản trị viên', 1, '[2024:11:07 20:23:52]: Lấy danh sách quyền hạn', '2024-11-07 13:23:52'),
(690, 1, 'Quản trị viên', 1, '[2024:11:07 20:23:52]: Thấy thông tin cá nhân', '2024-11-07 13:23:52'),
(691, 1, 'Quản trị viên', 1, '[2024:11:07 20:23:53]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:23:53'),
(692, 1, 'Quản trị viên', 1, '[2024:11:07 20:26:15]: Lấy danh sách quyền hạn', '2024-11-07 13:26:15'),
(693, 1, 'Quản trị viên', 1, '[2024:11:07 20:26:15]: Thấy thông tin cá nhân', '2024-11-07 13:26:15'),
(694, 1, 'Quản trị viên', 1, '[2024:11:07 20:26:15]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:26:15'),
(695, 1, 'Quản trị viên', 1, '[2024:11:07 20:28:03]: Lấy danh sách quyền hạn', '2024-11-07 13:28:03'),
(696, 1, 'Quản trị viên', 1, '[2024:11:07 20:28:03]: Thấy thông tin cá nhân', '2024-11-07 13:28:03'),
(697, 1, 'Quản trị viên', 1, '[2024:11:07 20:28:03]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:28:03'),
(698, 1, 'Quản trị viên', 1, '[2024:11:07 20:29:35]: Lấy danh sách quyền hạn', '2024-11-07 13:29:35'),
(699, 1, 'Quản trị viên', 1, '[2024:11:07 20:29:35]: Thấy thông tin cá nhân', '2024-11-07 13:29:35'),
(700, 1, 'Quản trị viên', 1, '[2024:11:07 20:29:36]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:29:36'),
(701, 1, 'Quản trị viên', 1, '[2024:11:07 20:30:52]: Lấy danh sách quyền hạn', '2024-11-07 13:30:52'),
(702, 1, 'Quản trị viên', 1, '[2024:11:07 20:30:52]: Thấy thông tin cá nhân', '2024-11-07 13:30:52'),
(703, 1, 'Quản trị viên', 1, '[2024:11:07 20:30:52]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:30:52'),
(704, 1, 'Quản trị viên', 1, '[2024:11:07 20:31:19]: Lấy danh sách quyền hạn', '2024-11-07 13:31:19'),
(705, 1, 'Quản trị viên', 1, '[2024:11:07 20:31:19]: Thấy thông tin cá nhân', '2024-11-07 13:31:19'),
(706, 1, 'Quản trị viên', 1, '[2024:11:07 20:31:19]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 13:31:19'),
(707, 1, 'Quản trị viên', 1, '[2024:11:07 21:03:22]: Lấy danh sách quyền hạn', '2024-11-07 14:03:22'),
(708, 1, 'Quản trị viên', 1, '[2024:11:07 21:03:22]: Thấy thông tin cá nhân', '2024-11-07 14:03:22'),
(709, 1, 'Quản trị viên', 1, '[2024:11:07 21:03:23]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:03:23'),
(710, 1, 'Quản trị viên', 1, '[2024:11:07 21:08:38]: Lấy danh sách quyền hạn', '2024-11-07 14:08:38'),
(711, 1, 'Quản trị viên', 1, '[2024:11:07 21:08:38]: Thấy thông tin cá nhân', '2024-11-07 14:08:38'),
(712, 1, 'Quản trị viên', 1, '[2024:11:07 21:08:38]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:08:38'),
(713, 1, 'Quản trị viên', 1, '[2024:11:07 21:08:38]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:08:38'),
(714, 1, 'Quản trị viên', 1, '[2024:11:07 21:09:26]: Lấy danh sách quyền hạn', '2024-11-07 14:09:26'),
(715, 1, 'Quản trị viên', 1, '[2024:11:07 21:09:26]: Thấy thông tin cá nhân', '2024-11-07 14:09:26'),
(716, 1, 'Quản trị viên', 1, '[2024:11:07 21:09:26]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:09:26'),
(717, 1, 'Quản trị viên', 1, '[2024:11:07 21:09:26]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:09:26'),
(718, 1, 'Quản trị viên', 1, '[2024:11:07 21:13:28]: Lấy danh sách quyền hạn', '2024-11-07 14:13:28'),
(719, 1, 'Quản trị viên', 1, '[2024:11:07 21:13:28]: Thấy thông tin cá nhân', '2024-11-07 14:13:28'),
(720, 1, 'Quản trị viên', 1, '[2024:11:07 21:13:28]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:13:28'),
(721, 1, 'Quản trị viên', 1, '[2024:11:07 21:13:28]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:13:28'),
(722, 1, 'Quản trị viên', 1, '[2024:11:07 21:31:41]: Lấy danh sách quyền hạn', '2024-11-07 14:31:41'),
(723, 1, 'Quản trị viên', 1, '[2024:11:07 21:31:41]: Thấy thông tin cá nhân', '2024-11-07 14:31:41'),
(724, 1, 'Quản trị viên', 0, '[2024:11:07 21:31:41]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:31:41'),
(725, 1, 'Quản trị viên', 1, '[2024:11:07 21:31:41]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:31:41'),
(726, 1, 'Quản trị viên', 1, '[2024:11:07 21:32:06]: Lấy danh sách quyền hạn', '2024-11-07 14:32:06'),
(727, 1, 'Quản trị viên', 1, '[2024:11:07 21:32:06]: Thấy thông tin cá nhân', '2024-11-07 14:32:06'),
(728, 1, 'Quản trị viên', 1, '[2024:11:07 21:32:06]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:32:06'),
(729, 1, 'Quản trị viên', 1, '[2024:11:07 21:32:06]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:32:06'),
(730, 1, 'Quản trị viên', 1, '[2024:11:07 21:34:51]: Lấy danh sách quyền hạn', '2024-11-07 14:34:51'),
(731, 1, 'Quản trị viên', 1, '[2024:11:07 21:34:51]: Thấy thông tin cá nhân', '2024-11-07 14:34:51'),
(732, 1, 'Quản trị viên', 0, '[2024:11:07 21:34:52]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:34:52'),
(733, 1, 'Quản trị viên', 1, '[2024:11:07 21:34:52]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:34:52'),
(734, 1, 'Quản trị viên', 1, '[2024:11:07 21:35:57]: Lấy danh sách quyền hạn', '2024-11-07 14:35:57'),
(735, 1, 'Quản trị viên', 1, '[2024:11:07 21:35:57]: Thấy thông tin cá nhân', '2024-11-07 14:35:57'),
(736, 1, 'Quản trị viên', 0, '[2024:11:07 21:35:58]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:35:58'),
(737, 1, 'Quản trị viên', 1, '[2024:11:07 21:35:58]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:35:58'),
(738, 1, 'Quản trị viên', 1, '[2024:11:07 21:38:52]: Lấy danh sách quyền hạn', '2024-11-07 14:38:52'),
(739, 1, 'Quản trị viên', 1, '[2024:11:07 21:38:52]: Thấy thông tin cá nhân', '2024-11-07 14:38:52'),
(740, 1, 'Quản trị viên', 1, '[2024:11:07 21:38:53]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:38:53'),
(741, 1, 'Quản trị viên', 1, '[2024:11:07 21:38:53]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:38:53'),
(742, 1, 'Quản trị viên', 1, '[2024:11:07 21:45:40]: Lấy danh sách quyền hạn', '2024-11-07 14:45:40'),
(743, 1, 'Quản trị viên', 1, '[2024:11:07 21:45:40]: Thấy thông tin cá nhân', '2024-11-07 14:45:40'),
(744, 1, 'Quản trị viên', 1, '[2024:11:07 21:45:40]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:45:40'),
(745, 1, 'Quản trị viên', 1, '[2024:11:07 21:45:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:45:40'),
(746, 1, 'Quản trị viên', 1, '[2024:11:07 21:48:17]: Lấy danh sách quyền hạn', '2024-11-07 14:48:17'),
(747, 1, 'Quản trị viên', 1, '[2024:11:07 21:48:17]: Thấy thông tin cá nhân', '2024-11-07 14:48:17'),
(748, 1, 'Quản trị viên', 1, '[2024:11:07 21:48:17]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:48:17'),
(749, 1, 'Quản trị viên', 1, '[2024:11:07 21:48:17]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:48:17'),
(750, 1, 'Quản trị viên', 1, '[2024:11:07 21:52:13]: Lấy danh sách quyền hạn', '2024-11-07 14:52:13'),
(751, 1, 'Quản trị viên', 1, '[2024:11:07 21:52:13]: Thấy thông tin cá nhân', '2024-11-07 14:52:13'),
(752, 1, 'Quản trị viên', 1, '[2024:11:07 21:52:14]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:52:14'),
(753, 1, 'Quản trị viên', 1, '[2024:11:07 21:52:14]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:52:14'),
(754, 1, 'Quản trị viên', 1, '[2024:11:07 21:57:56]: Lấy danh sách quyền hạn', '2024-11-07 14:57:55'),
(755, 1, 'Quản trị viên', 1, '[2024:11:07 21:57:56]: Thấy thông tin cá nhân', '2024-11-07 14:57:55'),
(756, 1, 'Quản trị viên', 1, '[2024:11:07 21:57:56]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:57:56'),
(757, 1, 'Quản trị viên', 1, '[2024:11:07 21:57:56]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:57:56'),
(758, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:10]: Lấy danh sách quyền hạn', '2024-11-07 14:58:10'),
(759, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:10]: Thấy thông tin cá nhân', '2024-11-07 14:58:10'),
(760, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:10]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:58:10'),
(761, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:10]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:58:10'),
(762, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:47]: Lấy danh sách quyền hạn', '2024-11-07 14:58:47'),
(763, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:47]: Thấy thông tin cá nhân', '2024-11-07 14:58:47'),
(764, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:47]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:58:47'),
(765, 1, 'Quản trị viên', 1, '[2024:11:07 21:58:47]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:58:47'),
(766, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:24]: Lấy danh sách quyền hạn', '2024-11-07 14:59:24'),
(767, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:24]: Thấy thông tin cá nhân', '2024-11-07 14:59:24'),
(768, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:24]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:59:24'),
(769, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:24]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:59:24'),
(770, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:55]: Lấy danh sách quyền hạn', '2024-11-07 14:59:55'),
(771, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:55]: Thấy thông tin cá nhân', '2024-11-07 14:59:55'),
(772, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:56]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 14:59:56'),
(773, 1, 'Quản trị viên', 1, '[2024:11:07 21:59:56]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 14:59:56'),
(774, 1, 'Quản trị viên', 1, '[2024:11:07 22:00:45]: Lấy danh sách quyền hạn', '2024-11-07 15:00:45'),
(775, 1, 'Quản trị viên', 1, '[2024:11:07 22:00:45]: Thấy thông tin cá nhân', '2024-11-07 15:00:45'),
(776, 1, 'Quản trị viên', 1, '[2024:11:07 22:00:45]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:00:45'),
(777, 1, 'Quản trị viên', 1, '[2024:11:07 22:00:46]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:00:46'),
(778, 1, 'Quản trị viên', 1, '[2024:11:07 22:02:38]: Lấy danh sách quyền hạn', '2024-11-07 15:02:38'),
(779, 1, 'Quản trị viên', 1, '[2024:11:07 22:02:38]: Thấy thông tin cá nhân', '2024-11-07 15:02:38'),
(780, 1, 'Quản trị viên', 0, '[2024:11:07 22:02:38]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:02:38'),
(781, 1, 'Quản trị viên', 1, '[2024:11:07 22:02:38]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:02:38'),
(782, 1, 'Quản trị viên', 1, '[2024:11:07 22:03:09]: Lấy danh sách quyền hạn', '2024-11-07 15:03:09'),
(783, 1, 'Quản trị viên', 1, '[2024:11:07 22:03:09]: Thấy thông tin cá nhân', '2024-11-07 15:03:09'),
(784, 1, 'Quản trị viên', 1, '[2024:11:07 22:03:09]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:03:09'),
(785, 1, 'Quản trị viên', 1, '[2024:11:07 22:03:09]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:03:09'),
(786, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:18]: Lấy danh sách quyền hạn', '2024-11-07 15:04:18'),
(787, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:18]: Thấy thông tin cá nhân', '2024-11-07 15:04:18'),
(788, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:18]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:04:18'),
(789, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:18]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:04:18'),
(790, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:42]: Lấy danh sách quyền hạn', '2024-11-07 15:04:42'),
(791, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:42]: Thấy thông tin cá nhân', '2024-11-07 15:04:42'),
(792, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:43]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:04:43'),
(793, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:43]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:04:43'),
(794, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:57]: Lấy danh sách quyền hạn', '2024-11-07 15:04:57'),
(795, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:57]: Thấy thông tin cá nhân', '2024-11-07 15:04:57'),
(796, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:57]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:04:57'),
(797, 1, 'Quản trị viên', 1, '[2024:11:07 22:04:57]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:04:57'),
(798, 1, 'Quản trị viên', 1, '[2024:11:07 22:23:43]: Lấy danh sách quyền hạn', '2024-11-07 15:23:43'),
(799, 1, 'Quản trị viên', 1, '[2024:11:07 22:23:43]: Thấy thông tin cá nhân', '2024-11-07 15:23:43'),
(800, 1, 'Quản trị viên', 1, '[2024:11:07 22:23:43]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:23:43'),
(801, 1, 'Quản trị viên', 1, '[2024:11:07 22:23:43]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:23:43'),
(802, 1, 'Quản trị viên', 1, '[2024:11:07 22:24:04]: Lấy danh sách quyền hạn', '2024-11-07 15:24:04'),
(803, 1, 'Quản trị viên', 1, '[2024:11:07 22:24:04]: Thấy thông tin cá nhân', '2024-11-07 15:24:04'),
(804, 1, 'Quản trị viên', 1, '[2024:11:07 22:24:04]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:24:04'),
(805, 1, 'Quản trị viên', 1, '[2024:11:07 22:24:04]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:24:04'),
(806, 1, 'Quản trị viên', 1, '[2024:11:07 22:29:49]: Lấy danh sách quyền hạn', '2024-11-07 15:29:49'),
(807, 1, 'Quản trị viên', 1, '[2024:11:07 22:29:49]: Thấy thông tin cá nhân', '2024-11-07 15:29:49'),
(808, 1, 'Quản trị viên', 1, '[2024:11:07 22:29:49]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-07 15:29:49'),
(809, 1, 'Quản trị viên', 1, '[2024:11:07 22:29:49]: Xem toàn bộ bài tập hệ thống.', '2024-11-07 15:29:49'),
(810, 1, 'Quản trị viên', 1, '[2024:11:08 09:35:36]: Lấy danh sách quyền hạn', '2024-11-08 02:35:36'),
(811, 1, 'Quản trị viên', 1, '[2024:11:08 09:35:36]: Thấy thông tin cá nhân', '2024-11-08 02:35:36'),
(812, 1, 'Quản trị viên', 1, '[2024:11:08 09:35:36]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-08 02:35:36'),
(813, 1, 'Quản trị viên', 1, '[2024:11:08 09:35:36]: Xem toàn bộ bài tập hệ thống.', '2024-11-08 02:35:36'),
(814, 2, 'Quản trị viên', 0, '[2024:11:09 08:44:56]: Mã xác thực hết hạn', '2024-11-09 01:44:56'),
(815, 2, 'Quản trị viên', 0, '[2024:11:09 08:44:56]: Mã xác thực hết hạn', '2024-11-09 01:44:56'),
(816, 1, 'Quản trị viên', 1, '[2024:11:09 08:47:36]: Lấy danh sách quyền hạn', '2024-11-09 01:47:36'),
(817, 1, 'Quản trị viên', 1, '[2024:11:09 08:47:36]: Thấy thông tin cá nhân', '2024-11-09 01:47:36'),
(818, 1, 'Quản trị viên', 1, '[2024:11:09 08:48:06]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 01:48:06'),
(819, 1, 'Quản trị viên', 1, '[2024:11:09 08:48:06]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 01:48:06'),
(820, 1, 'Quản trị viên', 1, '[2024:11:09 09:46:14]: Lấy danh sách quyền hạn', '2024-11-09 02:46:14'),
(821, 1, 'Quản trị viên', 1, '[2024:11:09 09:46:14]: Thấy thông tin cá nhân', '2024-11-09 02:46:14'),
(822, 1, 'Quản trị viên', 1, '[2024:11:09 09:46:14]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 02:46:14'),
(823, 1, 'Quản trị viên', 1, '[2024:11:09 09:46:14]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 02:46:14'),
(824, 1, 'Quản trị viên', 1, '[2024:11:09 09:48:43]: Lấy danh sách quyền hạn', '2024-11-09 02:48:43'),
(825, 1, 'Quản trị viên', 1, '[2024:11:09 09:48:43]: Thấy thông tin cá nhân', '2024-11-09 02:48:43'),
(826, 1, 'Quản trị viên', 1, '[2024:11:09 09:48:43]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 02:48:43'),
(827, 1, 'Quản trị viên', 1, '[2024:11:09 09:48:43]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 02:48:43'),
(828, 1, 'Quản trị viên', 1, '[2024:11:09 09:54:48]: Lấy danh sách quyền hạn', '2024-11-09 02:54:48'),
(829, 1, 'Quản trị viên', 1, '[2024:11:09 09:54:48]: Thấy thông tin cá nhân', '2024-11-09 02:54:48'),
(830, 1, 'Quản trị viên', 1, '[2024:11:09 09:54:48]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 02:54:48'),
(831, 1, 'Quản trị viên', 1, '[2024:11:09 09:54:48]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 02:54:48'),
(832, 1, 'Quản trị viên', 1, '[2024:11:09 09:57:03]: Lấy danh sách quyền hạn', '2024-11-09 02:57:03'),
(833, 1, 'Quản trị viên', 1, '[2024:11:09 09:57:03]: Thấy thông tin cá nhân', '2024-11-09 02:57:03'),
(834, 1, 'Quản trị viên', 1, '[2024:11:09 09:57:03]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 02:57:03'),
(835, 1, 'Quản trị viên', 1, '[2024:11:09 09:57:03]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 02:57:03'),
(836, 7, 'Đăng nhập qua tài khoản google', 1, '', '2024-11-09 03:03:06'),
(837, 2, 'Đăng nhập', 0, '', '2024-11-09 03:05:24'),
(838, 2, 'Đăng nhập', 1, '[2024:11:09 10:05:58]: Đăng nhập thành công.', '2024-11-09 03:05:58'),
(839, 6, 'Đăng nhập qua tài khoản github', 1, '', '2024-11-09 03:06:37'),
(840, 1, 'Quản trị viên', 1, '[2024:11:09 10:06:50]: Lấy danh sách quyền hạn', '2024-11-09 03:06:50'),
(841, 1, 'Quản trị viên', 1, '[2024:11:09 10:06:50]: Thấy thông tin cá nhân', '2024-11-09 03:06:50'),
(842, 1, 'Quản trị viên', 1, '[2024:11:09 10:06:51]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:06:51'),
(843, 1, 'Quản trị viên', 1, '[2024:11:09 10:06:51]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:06:51'),
(844, 1, 'Quản trị viên', 1, '[2024:11:09 10:16:36]: Lấy danh sách quyền hạn', '2024-11-09 03:16:36'),
(845, 1, 'Quản trị viên', 1, '[2024:11:09 10:16:36]: Thấy thông tin cá nhân', '2024-11-09 03:16:36'),
(846, 1, 'Quản trị viên', 1, '[2024:11:09 10:16:36]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:16:36'),
(847, 1, 'Quản trị viên', 1, '[2024:11:09 10:16:36]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:16:36'),
(848, 1, 'Quản trị viên', 1, '[2024:11:09 10:27:39]: Lấy danh sách quyền hạn', '2024-11-09 03:27:39'),
(849, 1, 'Quản trị viên', 1, '[2024:11:09 10:27:39]: Thấy thông tin cá nhân', '2024-11-09 03:27:39'),
(850, 1, 'Quản trị viên', 1, '[2024:11:09 10:27:39]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:27:39'),
(851, 1, 'Quản trị viên', 1, '[2024:11:09 10:27:39]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:27:39'),
(852, 1, 'Quản trị viên', 1, '[2024:11:09 10:29:47]: Lấy danh sách quyền hạn', '2024-11-09 03:29:47'),
(853, 1, 'Quản trị viên', 1, '[2024:11:09 10:29:47]: Thấy thông tin cá nhân', '2024-11-09 03:29:47'),
(854, 1, 'Quản trị viên', 1, '[2024:11:09 10:29:48]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:29:48'),
(855, 1, 'Quản trị viên', 1, '[2024:11:09 10:29:48]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:29:48'),
(856, 1, 'Quản trị viên', 1, '[2024:11:09 10:34:44]: Lấy danh sách quyền hạn', '2024-11-09 03:34:44'),
(857, 1, 'Quản trị viên', 1, '[2024:11:09 10:34:44]: Thấy thông tin cá nhân', '2024-11-09 03:34:44'),
(858, 1, 'Quản trị viên', 1, '[2024:11:09 10:34:44]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:34:44'),
(859, 1, 'Quản trị viên', 1, '[2024:11:09 10:34:44]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:34:44'),
(860, 1, 'Quản trị viên', 1, '[2024:11:09 10:37:11]: Lấy danh sách quyền hạn', '2024-11-09 03:37:11'),
(861, 1, 'Quản trị viên', 1, '[2024:11:09 10:37:11]: Thấy thông tin cá nhân', '2024-11-09 03:37:11'),
(862, 1, 'Quản trị viên', 1, '[2024:11:09 10:37:11]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:37:11'),
(863, 1, 'Quản trị viên', 1, '[2024:11:09 10:39:31]: Lấy danh sách quyền hạn', '2024-11-09 03:39:31'),
(864, 1, 'Quản trị viên', 1, '[2024:11:09 10:39:31]: Thấy thông tin cá nhân', '2024-11-09 03:39:31'),
(865, 1, 'Quản trị viên', 1, '[2024:11:09 10:39:31]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:39:31'),
(866, 1, 'Quản trị viên', 1, '[2024:11:09 10:39:31]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:39:31'),
(867, 1, 'Quản trị viên', 1, '[2024:11:09 10:55:12]: Lấy danh sách quyền hạn', '2024-11-09 03:55:12'),
(868, 1, 'Quản trị viên', 1, '[2024:11:09 10:55:12]: Thấy thông tin cá nhân', '2024-11-09 03:55:12'),
(869, 1, 'Quản trị viên', 1, '[2024:11:09 10:55:13]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 03:55:13'),
(870, 1, 'Quản trị viên', 1, '[2024:11:09 10:55:13]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 03:55:13'),
(871, 1, 'Quản trị viên', 1, '[2024:11:09 11:06:27]: Lấy danh sách quyền hạn', '2024-11-09 04:06:27'),
(872, 1, 'Quản trị viên', 1, '[2024:11:09 11:06:27]: Thấy thông tin cá nhân', '2024-11-09 04:06:27'),
(873, 1, 'Quản trị viên', 1, '[2024:11:09 11:06:27]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:06:27'),
(874, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:09]: Lấy danh sách quyền hạn', '2024-11-09 04:08:09'),
(875, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:09]: Thấy thông tin cá nhân', '2024-11-09 04:08:09'),
(876, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:10]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:08:10'),
(877, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:55]: Lấy danh sách quyền hạn', '2024-11-09 04:08:55'),
(878, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:55]: Thấy thông tin cá nhân', '2024-11-09 04:08:55'),
(879, 1, 'Quản trị viên', 1, '[2024:11:09 11:08:55]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:08:55'),
(880, 1, 'Quản trị viên', 1, '[2024:11:09 11:10:02]: Lấy danh sách quyền hạn', '2024-11-09 04:10:02'),
(881, 1, 'Quản trị viên', 1, '[2024:11:09 11:10:02]: Thấy thông tin cá nhân', '2024-11-09 04:10:02'),
(882, 1, 'Quản trị viên', 1, '[2024:11:09 11:10:02]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:10:02'),
(883, 1, 'Quản trị viên', 1, '[2024:11:09 11:13:07]: Lấy danh sách quyền hạn', '2024-11-09 04:13:07'),
(884, 1, 'Quản trị viên', 1, '[2024:11:09 11:13:07]: Thấy thông tin cá nhân', '2024-11-09 04:13:07'),
(885, 1, 'Quản trị viên', 1, '[2024:11:09 11:13:07]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:13:07'),
(886, 1, 'Quản trị viên', 1, '[2024:11:09 11:13:07]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:13:07'),
(887, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:16]: Lấy danh sách quyền hạn', '2024-11-09 04:14:16'),
(888, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:16]: Thấy thông tin cá nhân', '2024-11-09 04:14:16'),
(889, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:16]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:14:16'),
(890, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:16]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:14:16'),
(891, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:21]: Lấy danh sách quyền hạn', '2024-11-09 04:14:21'),
(892, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:21]: Thấy thông tin cá nhân', '2024-11-09 04:14:21'),
(893, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:22]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:14:22'),
(894, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:22]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:14:22'),
(895, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:49]: Lấy danh sách quyền hạn', '2024-11-09 04:14:49'),
(896, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:49]: Thấy thông tin cá nhân', '2024-11-09 04:14:49'),
(897, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:49]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:14:49'),
(898, 1, 'Quản trị viên', 1, '[2024:11:09 11:14:49]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:14:49'),
(899, 1, 'Quản trị viên', 1, '[2024:11:09 11:15:58]: Lấy danh sách quyền hạn', '2024-11-09 04:15:58'),
(900, 1, 'Quản trị viên', 1, '[2024:11:09 11:15:58]: Thấy thông tin cá nhân', '2024-11-09 04:15:58'),
(901, 1, 'Quản trị viên', 1, '[2024:11:09 11:15:58]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:15:58'),
(902, 1, 'Quản trị viên', 1, '[2024:11:09 11:15:58]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:15:58'),
(903, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:06]: Lấy danh sách quyền hạn', '2024-11-09 04:17:06'),
(904, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:06]: Thấy thông tin cá nhân', '2024-11-09 04:17:06'),
(905, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:06]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:17:06'),
(906, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:35]: Lấy danh sách quyền hạn', '2024-11-09 04:17:35'),
(907, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:35]: Thấy thông tin cá nhân', '2024-11-09 04:17:35'),
(908, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:35]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:17:35'),
(909, 1, 'Quản trị viên', 1, '[2024:11:09 11:17:35]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:17:35'),
(910, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:12]: Lấy danh sách quyền hạn', '2024-11-09 04:21:12'),
(911, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:12]: Thấy thông tin cá nhân', '2024-11-09 04:21:12'),
(912, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:12]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:21:12'),
(913, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:12]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:21:12'),
(914, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:30]: Lấy danh sách quyền hạn', '2024-11-09 04:21:30'),
(915, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:30]: Thấy thông tin cá nhân', '2024-11-09 04:21:30'),
(916, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:30]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:21:30'),
(917, 1, 'Quản trị viên', 1, '[2024:11:09 11:21:30]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:21:30'),
(918, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:19]: Lấy danh sách quyền hạn', '2024-11-09 04:22:19'),
(919, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:19]: Thấy thông tin cá nhân', '2024-11-09 04:22:19'),
(920, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:19]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:22:19'),
(921, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:19]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:22:19'),
(922, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:35]: Lấy danh sách quyền hạn', '2024-11-09 04:22:35'),
(923, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:35]: Thấy thông tin cá nhân', '2024-11-09 04:22:35'),
(924, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:36]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:22:36'),
(925, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:36]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:22:36'),
(926, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:39]: Lấy danh sách quyền hạn', '2024-11-09 04:22:39'),
(927, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:39]: Thấy thông tin cá nhân', '2024-11-09 04:22:39'),
(928, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:39]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:22:39'),
(929, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:39]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:22:39'),
(930, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:46]: Lấy danh sách quyền hạn', '2024-11-09 04:22:46'),
(931, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:46]: Thấy thông tin cá nhân', '2024-11-09 04:22:46'),
(932, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:46]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:22:46'),
(933, 1, 'Quản trị viên', 1, '[2024:11:09 11:22:46]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:22:46'),
(934, 1, 'Quản trị viên', 1, '[2024:11:09 11:24:28]: Lấy danh sách quyền hạn', '2024-11-09 04:24:28'),
(935, 1, 'Quản trị viên', 1, '[2024:11:09 11:24:28]: Thấy thông tin cá nhân', '2024-11-09 04:24:28'),
(936, 1, 'Quản trị viên', 1, '[2024:11:09 11:24:28]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:24:28'),
(937, 1, 'Quản trị viên', 1, '[2024:11:09 11:24:28]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:24:28'),
(938, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:46]: Lấy danh sách quyền hạn', '2024-11-09 04:26:46'),
(939, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:46]: Thấy thông tin cá nhân', '2024-11-09 04:26:46'),
(940, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:46]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:26:46'),
(941, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:46]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:26:46'),
(942, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:57]: Lấy danh sách quyền hạn', '2024-11-09 04:26:57'),
(943, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:57]: Thấy thông tin cá nhân', '2024-11-09 04:26:57'),
(944, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:57]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:26:57'),
(945, 1, 'Quản trị viên', 1, '[2024:11:09 11:26:57]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:26:57'),
(946, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:11]: Lấy danh sách quyền hạn', '2024-11-09 04:27:11'),
(947, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:11]: Thấy thông tin cá nhân', '2024-11-09 04:27:11'),
(948, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:11]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:27:11'),
(949, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:11]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:27:11'),
(950, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:39]: Lấy danh sách quyền hạn', '2024-11-09 04:27:39'),
(951, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:39]: Thấy thông tin cá nhân', '2024-11-09 04:27:39'),
(952, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:39]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:27:39'),
(953, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:27:39'),
(954, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:42]: Lấy danh sách quyền hạn', '2024-11-09 04:27:42'),
(955, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:42]: Thấy thông tin cá nhân', '2024-11-09 04:27:42'),
(956, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:43]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:27:43'),
(957, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:43]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:27:43'),
(958, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:46]: Lấy danh sách quyền hạn', '2024-11-09 04:27:46'),
(959, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:46]: Thấy thông tin cá nhân', '2024-11-09 04:27:46'),
(960, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:46]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:27:46'),
(961, 1, 'Quản trị viên', 1, '[2024:11:09 11:27:46]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:27:46'),
(962, 1, 'Quản trị viên', 1, '[2024:11:09 11:29:09]: Lấy danh sách quyền hạn', '2024-11-09 04:29:09'),
(963, 1, 'Quản trị viên', 1, '[2024:11:09 11:29:09]: Thấy thông tin cá nhân', '2024-11-09 04:29:09'),
(964, 1, 'Quản trị viên', 1, '[2024:11:09 11:29:09]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:29:09'),
(965, 1, 'Quản trị viên', 1, '[2024:11:09 11:29:09]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:29:09'),
(966, 1, 'Quản trị viên', 1, '[2024:11:09 11:34:40]: Lấy danh sách quyền hạn', '2024-11-09 04:34:40'),
(967, 1, 'Quản trị viên', 1, '[2024:11:09 11:34:40]: Thấy thông tin cá nhân', '2024-11-09 04:34:40'),
(968, 1, 'Quản trị viên', 1, '[2024:11:09 11:34:40]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:34:40'),
(969, 1, 'Quản trị viên', 1, '[2024:11:09 11:34:40]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:34:40'),
(970, 1, 'Quản trị viên', 1, '[2024:11:09 11:35:12]: Lấy danh sách quyền hạn', '2024-11-09 04:35:12'),
(971, 1, 'Quản trị viên', 1, '[2024:11:09 11:35:12]: Thấy thông tin cá nhân', '2024-11-09 04:35:12'),
(972, 1, 'Quản trị viên', 1, '[2024:11:09 11:35:13]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:35:13'),
(973, 1, 'Quản trị viên', 1, '[2024:11:09 11:35:13]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:35:13'),
(974, 1, 'Quản trị viên', 1, '[2024:11:09 11:36:15]: Lấy danh sách quyền hạn', '2024-11-09 04:36:15'),
(975, 1, 'Quản trị viên', 1, '[2024:11:09 11:36:15]: Thấy thông tin cá nhân', '2024-11-09 04:36:15'),
(976, 1, 'Quản trị viên', 1, '[2024:11:09 11:36:15]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:36:15'),
(977, 1, 'Quản trị viên', 1, '[2024:11:09 11:36:15]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:36:15'),
(978, 1, 'Quản trị viên', 1, '[2024:11:09 11:47:24]: Lấy danh sách quyền hạn', '2024-11-09 04:47:24'),
(979, 1, 'Quản trị viên', 1, '[2024:11:09 11:47:24]: Thấy thông tin cá nhân', '2024-11-09 04:47:24'),
(980, 1, 'Quản trị viên', 1, '[2024:11:09 11:47:25]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:47:25'),
(981, 1, 'Quản trị viên', 1, '[2024:11:09 11:47:25]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:47:25'),
(982, 1, 'Quản trị viên', 1, '[2024:11:09 11:48:07]: Lấy danh sách quyền hạn', '2024-11-09 04:48:07'),
(983, 1, 'Quản trị viên', 1, '[2024:11:09 11:48:07]: Thấy thông tin cá nhân', '2024-11-09 04:48:07'),
(984, 1, 'Quản trị viên', 1, '[2024:11:09 11:48:08]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:48:08'),
(985, 1, 'Quản trị viên', 1, '[2024:11:09 11:48:08]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:48:08'),
(986, 1, 'Quản trị viên', 1, '[2024:11:09 11:49:59]: Lấy danh sách quyền hạn', '2024-11-09 04:49:59'),
(987, 1, 'Quản trị viên', 1, '[2024:11:09 11:49:59]: Thấy thông tin cá nhân', '2024-11-09 04:49:59'),
(988, 1, 'Quản trị viên', 1, '[2024:11:09 11:49:59]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:49:59'),
(989, 1, 'Quản trị viên', 1, '[2024:11:09 11:49:59]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:49:59'),
(990, 1, 'Quản trị viên', 1, '[2024:11:09 11:51:05]: Lấy danh sách quyền hạn', '2024-11-09 04:51:05'),
(991, 1, 'Quản trị viên', 1, '[2024:11:09 11:51:05]: Thấy thông tin cá nhân', '2024-11-09 04:51:05'),
(992, 1, 'Quản trị viên', 1, '[2024:11:09 11:51:06]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 04:51:05'),
(993, 1, 'Quản trị viên', 1, '[2024:11:09 11:51:06]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 04:51:06'),
(994, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:22]: Lấy danh sách quyền hạn', '2024-11-09 05:06:22'),
(995, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:22]: Thấy thông tin cá nhân', '2024-11-09 05:06:22'),
(996, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:22]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:06:22'),
(997, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:22]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:06:22'),
(998, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:54]: Lấy danh sách quyền hạn', '2024-11-09 05:06:54'),
(999, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:54]: Thấy thông tin cá nhân', '2024-11-09 05:06:54'),
(1000, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:54]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:06:54'),
(1001, 1, 'Quản trị viên', 1, '[2024:11:09 12:06:54]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:06:54'),
(1002, 1, 'Quản trị viên', 1, '[2024:11:09 12:08:18]: Lấy danh sách quyền hạn', '2024-11-09 05:08:18'),
(1003, 1, 'Quản trị viên', 1, '[2024:11:09 12:08:18]: Thấy thông tin cá nhân', '2024-11-09 05:08:18'),
(1004, 1, 'Quản trị viên', 1, '[2024:11:09 12:08:18]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:08:18'),
(1005, 1, 'Quản trị viên', 1, '[2024:11:09 12:08:19]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:08:19'),
(1006, 1, 'Tạo chủ đề bài tập hệ thống', 1, '[2024:11:09 12:08:42]: Tạo chủ đề mới thành công.', '2024-11-09 05:08:42'),
(1007, 1, 'Quản trị viên', 1, '[2024:11:09 12:10:06]: Lấy danh sách quyền hạn', '2024-11-09 05:10:06'),
(1008, 1, 'Quản trị viên', 1, '[2024:11:09 12:10:06]: Thấy thông tin cá nhân', '2024-11-09 05:10:06'),
(1009, 1, 'Quản trị viên', 1, '[2024:11:09 12:10:06]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:10:06');
INSERT INTO `logs` (`id`, `user_id`, `action`, `status`, `detail`, `created_at`) VALUES
(1010, 1, 'Quản trị viên', 1, '[2024:11:09 12:10:07]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:10:07'),
(1011, 1, 'Quản trị viên', 1, '[2024:11:09 12:11:33]: Lấy danh sách quyền hạn', '2024-11-09 05:11:33'),
(1012, 1, 'Quản trị viên', 1, '[2024:11:09 12:11:33]: Thấy thông tin cá nhân', '2024-11-09 05:11:33'),
(1013, 1, 'Quản trị viên', 1, '[2024:11:09 12:11:33]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:11:33'),
(1014, 1, 'Quản trị viên', 1, '[2024:11:09 12:11:33]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:11:33'),
(1015, 1, 'Quản trị viên', 1, '[2024:11:09 12:13:18]: Lấy danh sách quyền hạn', '2024-11-09 05:13:18'),
(1016, 1, 'Quản trị viên', 1, '[2024:11:09 12:13:18]: Thấy thông tin cá nhân', '2024-11-09 05:13:18'),
(1017, 1, 'Quản trị viên', 1, '[2024:11:09 12:13:18]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:13:18'),
(1018, 1, 'Quản trị viên', 1, '[2024:11:09 12:13:18]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:13:18'),
(1019, 1, 'Quản trị viên', 1, '[2024:11:09 12:14:13]: Lấy danh sách quyền hạn', '2024-11-09 05:14:13'),
(1020, 1, 'Quản trị viên', 1, '[2024:11:09 12:14:13]: Thấy thông tin cá nhân', '2024-11-09 05:14:13'),
(1021, 1, 'Quản trị viên', 1, '[2024:11:09 12:14:13]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:14:13'),
(1022, 1, 'Quản trị viên', 1, '[2024:11:09 12:14:13]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:14:13'),
(1023, 1, 'Quản trị viên', 1, '[2024:11:09 12:17:42]: Lấy danh sách quyền hạn', '2024-11-09 05:17:42'),
(1024, 1, 'Quản trị viên', 1, '[2024:11:09 12:17:42]: Thấy thông tin cá nhân', '2024-11-09 05:17:42'),
(1025, 1, 'Quản trị viên', 1, '[2024:11:09 12:17:42]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:17:42'),
(1026, 1, 'Quản trị viên', 1, '[2024:11:09 12:17:42]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:17:42'),
(1027, 1, 'Tạo chủ đề bài tập hệ thống', 0, '', '2024-11-09 05:18:23'),
(1028, 1, 'Tạo chủ đề bài tập hệ thống', 0, '', '2024-11-09 05:19:01'),
(1029, 1, 'Quản trị viên', 1, '[2024:11:09 12:19:32]: Lấy danh sách quyền hạn', '2024-11-09 05:19:32'),
(1030, 1, 'Quản trị viên', 1, '[2024:11:09 12:19:32]: Thấy thông tin cá nhân', '2024-11-09 05:19:32'),
(1031, 1, 'Quản trị viên', 1, '[2024:11:09 12:19:33]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:19:33'),
(1032, 1, 'Quản trị viên', 1, '[2024:11:09 12:19:33]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:19:33'),
(1033, 1, 'Tạo chủ đề bài tập hệ thống', 0, '', '2024-11-09 05:19:55'),
(1034, 2, 'Quản trị viên', 0, '[2024:11:09 12:35:07]: Mã xác thực hết hạn', '2024-11-09 05:35:07'),
(1035, 2, 'Quản trị viên', 0, '[2024:11:09 12:36:41]: Mã xác thực hết hạn', '2024-11-09 05:36:41'),
(1036, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:11:09 12:36:53]: Đăng nhập thành công.', '2024-11-09 05:36:52'),
(1037, 1, 'Quản trị viên', 1, '[2024:11:09 12:36:53]: Lấy danh sách quyền hạn', '2024-11-09 05:36:53'),
(1038, 1, 'Quản trị viên', 1, '[2024:11:09 12:36:53]: Thấy thông tin cá nhân', '2024-11-09 05:36:53'),
(1039, 2, 'Quản trị viên', 0, '[2024:11:09 12:47:05]: Mã xác thực hết hạn', '2024-11-09 05:47:05'),
(1040, 1, 'Đăng nhập với tư cách quản trị viên', 1, '[2024:11:09 12:47:24]: Đăng nhập thành công.', '2024-11-09 05:47:24'),
(1041, 1, 'Quản trị viên', 1, '[2024:11:09 12:47:25]: Lấy danh sách quyền hạn', '2024-11-09 05:47:25'),
(1042, 1, 'Quản trị viên', 1, '[2024:11:09 12:47:25]: Thấy thông tin cá nhân', '2024-11-09 05:47:25'),
(1043, 1, 'Quản trị viên', 1, '[2024:11:09 12:47:30]: Xem số liệu thống kê bài tập hệ thống.', '2024-11-09 05:47:30'),
(1044, 1, 'Quản trị viên', 1, '[2024:11:09 12:47:30]: Xem toàn bộ bài tập hệ thống.', '2024-11-09 05:47:30');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `multiple_choice_exercises`
--

CREATE TABLE `multiple_choice_exercises` (
  `id` int(11) NOT NULL,
  `exercise_id` int(11) NOT NULL,
  `type` enum('single','multi') NOT NULL DEFAULT 'single',
  `question` text NOT NULL,
  `question_image` varchar(255) NOT NULL,
  `options` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`options`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `old_passwords`
--

CREATE TABLE `old_passwords` (
  `user_id` int(11) NOT NULL,
  `old_password` varchar(255) NOT NULL,
  `changed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `permissions`
--

CREATE TABLE `permissions` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `permissions`
--

INSERT INTO `permissions` (`id`, `name`) VALUES
(1, 'Quản trị viên'),
(2, 'Tạo tài khoản quản trị viên'),
(3, 'Phân quyền quản trị viên'),
(4, 'Vô hiệu hóa tài khoản quản trị viên'),
(5, 'Vô hiệu hóa tài khoản người dùng'),
(6, 'Tạo chủ đề bài tập hệ thống'),
(7, 'Chỉnh sửa chủ đề sửa bài tập hệ thống'),
(8, 'Xóa chủ đề sửa bài tập hệ thống'),
(9, 'Tạo bài tập hệ thống'),
(10, 'Chỉnh sửa bài tập hệ thống'),
(11, 'Xóa bài tập hệ thống');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `phone_verifications`
--

CREATE TABLE `phone_verifications` (
  `id` int(11) NOT NULL,
  `phone_number` varchar(11) NOT NULL,
  `otp_code` varchar(20) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `is_verified` tinyint(1) NOT NULL DEFAULT 0,
  `expires_at` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `roles`
--

CREATE TABLE `roles` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `roles`
--

INSERT INTO `roles` (`id`, `name`) VALUES
(1, 'Adminstrator'),
(2, 'Người dùng'),
(3, 'Quản trị viên bài tập hệ thống');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `role_permissions`
--

CREATE TABLE `role_permissions` (
  `role_id` int(11) NOT NULL,
  `permission_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `role_permissions`
--

INSERT INTO `role_permissions` (`role_id`, `permission_id`) VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(1, 7),
(1, 8),
(1, 9),
(1, 10),
(1, 11),
(3, 9),
(3, 10),
(3, 11);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `system_exercise_topics`
--

CREATE TABLE `system_exercise_topics` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image_url` varchar(500) DEFAULT NULL,
  `document_url` varchar(500) NOT NULL,
  `description` text DEFAULT NULL,
  `programming_language` enum('Cpp','Java','Pascal','Python','Multi') NOT NULL DEFAULT 'Multi',
  `unlock_condition_type` enum('all','any','single','none') DEFAULT 'none',
  `level` int(11) DEFAULT 1,
  `min_required_exercises` int(11) NOT NULL DEFAULT 1,
  `min_required_score` int(11) NOT NULL,
  `bonus_points` int(11) NOT NULL DEFAULT 50,
  `is_editable` tinyint(1) NOT NULL DEFAULT 1,
  `created_by` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_by` int(11) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `system_exercise_topics`
--

INSERT INTO `system_exercise_topics` (`id`, `name`, `image_url`, `document_url`, `description`, `programming_language`, `unlock_condition_type`, `level`, `min_required_exercises`, `min_required_score`, `bonus_points`, `is_editable`, `created_by`, `created_at`, `updated_by`, `updated_at`) VALUES
(2, 'Khởi đầu cùng WiseOwl', NULL, 'https://res.cloudinary.com/dvp8nwdbt/raw/upload/v1730979761/uploads/documents/1730979758125-Kh%C3%A1%C2%BB%C2%9Di%20%C3%84%C2%91%C3%A1%C2%BA%C2%A7u%20cung%20WiseOwl.pdf', 'Giới thiệu về lập trình', 'Multi', 'none', 1, 1, 100, 50, 1, 1, '2024-11-07 11:42:42', NULL, NULL),
(3, 'sdfsd', NULL, 'https://res.cloudinary.com/dvp8nwdbt/raw/upload/v1731128922/uploads/documents/1731128917138-Vu-Tien-Quyen-Intern-Fresher-NodeJs.pdf', 'sdfsdf', 'Multi', 'none', 1, 5, 50, 50, 1, 1, '2024-11-09 05:08:42', NULL, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `topic_unlock_conditions`
--

CREATE TABLE `topic_unlock_conditions` (
  `topic_id` int(11) NOT NULL,
  `condition_topic_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `provider` varchar(255) DEFAULT NULL,
  `provider_id` varchar(255) DEFAULT NULL,
  `fullname` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone_number` varchar(12) DEFAULT NULL,
  `gender` enum('Nam','Nữ','Khác','') NOT NULL,
  `date_of_birth` datetime DEFAULT NULL,
  `avatar_url` text NOT NULL,
  `role_id` int(11) NOT NULL DEFAULT 2,
  `last_activity` datetime NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `provider`, `provider_id`, `fullname`, `email`, `phone_number`, `gender`, `date_of_birth`, `avatar_url`, `role_id`, `last_activity`, `created_at`, `updated_at`) VALUES
(1, 'wiseowl@admin', 'a923a13cb68f7593c187ce8d77020fb2e04d913b28022f75e3751b1544337f79', NULL, NULL, 'Adminstrator', NULL, NULL, 'Khác', NULL, '', 1, '2024-11-09 12:47:25', '2024-10-26 09:11:00', '2024-11-09 05:47:25'),
(2, 'Quyen1506', '6e6d16908ed1c04a52ec391771202906412326d8c2de232fae486c26c51816c6', NULL, NULL, 'Vũ Tiến Quyền', NULL, NULL, 'Nam', NULL, '', 2, '2024-11-09 10:06:00', '2024-10-26 09:11:00', '2024-11-09 03:06:00'),
(6, 'HKJared', NULL, 'github', '3a4bff9505f4b25f14a28adf2acc81c72bd77bb0d7313294a2cf0e3c997e4aa4', 'Vu Tien Quyen', NULL, NULL, 'Nam', NULL, 'https://avatars.githubusercontent.com/u/124007412?v=4', 2, '2024-11-09 12:13:22', '2024-10-29 15:08:09', '2024-11-09 05:13:22'),
(7, 'vuq147', NULL, 'google', '20452a9b63dfb7886f35065fc1191d21afb90979b004ef40a77836c52a58bae1', 'Quyền Vũ', 'vuq147@gmail.com', NULL, 'Nam', NULL, 'https://lh3.googleusercontent.com/a/ACg8ocIooj9ouLMGdVyTPE39qLKrsghDs-0jCVeBZWPoXRfYlmSiOAUY=s96-c', 2, '2024-11-09 10:03:08', '2024-10-30 04:22:51', '2024-11-09 03:03:08');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_code_exercise_submissions`
--

CREATE TABLE `user_code_exercise_submissions` (
  `result_id` int(11) NOT NULL,
  `submitted_code` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_completed_topics`
--

CREATE TABLE `user_completed_topics` (
  `user_id` int(11) NOT NULL,
  `topic_id` int(11) NOT NULL,
  `completed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_disables`
--

CREATE TABLE `user_disables` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `disable_end` datetime NOT NULL,
  `reason` text NOT NULL,
  `note` text NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `created_by` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_by` int(11) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_exercise_results`
--

CREATE TABLE `user_exercise_results` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `exercise_id` int(11) NOT NULL,
  `is_completed` tinyint(1) NOT NULL DEFAULT 0,
  `started_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `completed_at` datetime DEFAULT NULL,
  `submission_count` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_multiple_choice_answers`
--

CREATE TABLE `user_multiple_choice_answers` (
  `id` int(11) NOT NULL,
  `result_id` int(11) NOT NULL,
  `selected_options` longtext NOT NULL,
  `is_correct` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `code_exercises`
--
ALTER TABLE `code_exercises`
  ADD PRIMARY KEY (`exercise_id`);

--
-- Chỉ mục cho bảng `email_verifications`
--
ALTER TABLE `email_verifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email_verifications_fk1` (`user_id`);

--
-- Chỉ mục cho bảng `exercises`
--
ALTER TABLE `exercises`
  ADD PRIMARY KEY (`id`),
  ADD KEY `exercise_fk1` (`topic_id`),
  ADD KEY `exercise_fk2` (`created_by`),
  ADD KEY `exercise_fk3` (`updated_by`);

--
-- Chỉ mục cho bảng `logs`
--
ALTER TABLE `logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `log_fk1` (`user_id`);

--
-- Chỉ mục cho bảng `multiple_choice_exercises`
--
ALTER TABLE `multiple_choice_exercises`
  ADD PRIMARY KEY (`id`),
  ADD KEY `multiple_choice_exercise_fk1` (`exercise_id`);

--
-- Chỉ mục cho bảng `old_passwords`
--
ALTER TABLE `old_passwords`
  ADD PRIMARY KEY (`user_id`,`old_password`);

--
-- Chỉ mục cho bảng `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `phone_verifications`
--
ALTER TABLE `phone_verifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phone_verifications_fk1` (`user_id`);

--
-- Chỉ mục cho bảng `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `role_permissions`
--
ALTER TABLE `role_permissions`
  ADD PRIMARY KEY (`role_id`,`permission_id`),
  ADD KEY `role_permission_fk2` (`permission_id`);

--
-- Chỉ mục cho bảng `system_exercise_topics`
--
ALTER TABLE `system_exercise_topics`
  ADD PRIMARY KEY (`id`),
  ADD KEY `system_exercise_topic_fk1` (`created_by`),
  ADD KEY `system_exercise_topic_fk2` (`updated_by`);

--
-- Chỉ mục cho bảng `topic_unlock_conditions`
--
ALTER TABLE `topic_unlock_conditions`
  ADD PRIMARY KEY (`topic_id`,`condition_topic_id`),
  ADD KEY `topic_unlock_condition_fk2` (`condition_topic_id`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `users_fk1` (`role_id`);

--
-- Chỉ mục cho bảng `user_code_exercise_submissions`
--
ALTER TABLE `user_code_exercise_submissions`
  ADD PRIMARY KEY (`result_id`);

--
-- Chỉ mục cho bảng `user_completed_topics`
--
ALTER TABLE `user_completed_topics`
  ADD PRIMARY KEY (`user_id`,`topic_id`),
  ADD KEY `user_completed_topic_fk2` (`topic_id`);

--
-- Chỉ mục cho bảng `user_disables`
--
ALTER TABLE `user_disables`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_disable_fk1` (`user_id`),
  ADD KEY `user_disable_fk2` (`created_by`),
  ADD KEY `user_disable_fk3` (`updated_by`);

--
-- Chỉ mục cho bảng `user_exercise_results`
--
ALTER TABLE `user_exercise_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_exercise_result_fk1` (`user_id`),
  ADD KEY `user_exercise_result_fk2` (`exercise_id`);

--
-- Chỉ mục cho bảng `user_multiple_choice_answers`
--
ALTER TABLE `user_multiple_choice_answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_multiple_choice_answer_fk1` (`result_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `exercises`
--
ALTER TABLE `exercises`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `logs`
--
ALTER TABLE `logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1045;

--
-- AUTO_INCREMENT cho bảng `multiple_choice_exercises`
--
ALTER TABLE `multiple_choice_exercises`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT cho bảng `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `system_exercise_topics`
--
ALTER TABLE `system_exercise_topics`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT cho bảng `user_exercise_results`
--
ALTER TABLE `user_exercise_results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `user_multiple_choice_answers`
--
ALTER TABLE `user_multiple_choice_answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `code_exercises`
--
ALTER TABLE `code_exercises`
  ADD CONSTRAINT `code_exercise_fk1` FOREIGN KEY (`exercise_id`) REFERENCES `exercises` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `email_verifications`
--
ALTER TABLE `email_verifications`
  ADD CONSTRAINT `email_verifications_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `exercises`
--
ALTER TABLE `exercises`
  ADD CONSTRAINT `exercise_fk1` FOREIGN KEY (`topic_id`) REFERENCES `system_exercise_topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `exercise_fk2` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL,
  ADD CONSTRAINT `exercise_fk3` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL;

--
-- Các ràng buộc cho bảng `logs`
--
ALTER TABLE `logs`
  ADD CONSTRAINT `log_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `multiple_choice_exercises`
--
ALTER TABLE `multiple_choice_exercises`
  ADD CONSTRAINT `multiple_choice_exercise_fk1` FOREIGN KEY (`exercise_id`) REFERENCES `exercises` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `old_passwords`
--
ALTER TABLE `old_passwords`
  ADD CONSTRAINT `old_pasword_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `phone_verifications`
--
ALTER TABLE `phone_verifications`
  ADD CONSTRAINT `phone_verifications_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL;

--
-- Các ràng buộc cho bảng `role_permissions`
--
ALTER TABLE `role_permissions`
  ADD CONSTRAINT `role_permission_fk1` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `role_permission_fk2` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `system_exercise_topics`
--
ALTER TABLE `system_exercise_topics`
  ADD CONSTRAINT `system_exercise_topic_fk1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL,
  ADD CONSTRAINT `system_exercise_topic_fk2` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL;

--
-- Các ràng buộc cho bảng `topic_unlock_conditions`
--
ALTER TABLE `topic_unlock_conditions`
  ADD CONSTRAINT `topic_unlock_condition_fk1` FOREIGN KEY (`topic_id`) REFERENCES `system_exercise_topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `topic_unlock_condition_fk2` FOREIGN KEY (`condition_topic_id`) REFERENCES `system_exercise_topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_fk1` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `user_code_exercise_submissions`
--
ALTER TABLE `user_code_exercise_submissions`
  ADD CONSTRAINT `user_code_exercise_submission_fk1` FOREIGN KEY (`result_id`) REFERENCES `user_exercise_results` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `user_completed_topics`
--
ALTER TABLE `user_completed_topics`
  ADD CONSTRAINT `user_completed_topic_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_completed_topic_fk2` FOREIGN KEY (`topic_id`) REFERENCES `system_exercise_topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `user_disables`
--
ALTER TABLE `user_disables`
  ADD CONSTRAINT `user_disable_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_disable_fk2` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL,
  ADD CONSTRAINT `user_disable_fk3` FOREIGN KEY (`updated_by`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL;

--
-- Các ràng buộc cho bảng `user_exercise_results`
--
ALTER TABLE `user_exercise_results`
  ADD CONSTRAINT `user_exercise_result_fk1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_exercise_result_fk2` FOREIGN KEY (`exercise_id`) REFERENCES `exercises` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Các ràng buộc cho bảng `user_multiple_choice_answers`
--
ALTER TABLE `user_multiple_choice_answers`
  ADD CONSTRAINT `user_multiple_choice_answer_fk1` FOREIGN KEY (`result_id`) REFERENCES `user_exercise_results` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
